FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_DAT_RESULT_Pos          ( 0 )                                                 /*!< EADC_T::DAT: RESULT Position          */
#define EADC_DAT_RESULT_Msk          ( 0xfffful << EADC_DAT_RESULT_Pos )                   /*!< EADC_T::DAT: RESULT Mask              */

#define EADC_DAT_OV_Pos              ( 16 )                                                /*!< EADC_T::DAT: OV Position              */
#define EADC_DAT_OV_Msk              ( 0x1ul << EADC_DAT_OV_Pos )                          /*!< EADC_T::DAT: OV Mask                  */

#define EADC_DAT_VALID_Pos           ( 17 )                                                /*!< EADC_T::DAT: VALID Position           */
#define EADC_DAT_VALID_Msk           ( 0x1ul << EADC_DAT_VALID_Pos )                       /*!< EADC_T::DAT: VALID Mask               */

#define EADC_DAT0_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT0: RESULT Position          */
#define EADC_DAT0_RESULT_Msk         ( 0xfffful << EADC_DAT0_RESULT_Pos )                  /*!< EADC_T::DAT0: RESULT Mask              */

#define EADC_DAT0_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT0: OV Position              */
#define EADC_DAT0_OV_Msk             ( 0x1ul << EADC_DAT0_OV_Pos )                         /*!< EADC_T::DAT0: OV Mask                  */

#define EADC_DAT0_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT0: VALID Position           */
#define EADC_DAT0_VALID_Msk          ( 0x1ul << EADC_DAT0_VALID_Pos )                      /*!< EADC_T::DAT0: VALID Mask               */

#define EADC_DAT1_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT1: RESULT Position          */
#define EADC_DAT1_RESULT_Msk         ( 0xfffful << EADC_DAT1_RESULT_Pos )                  /*!< EADC_T::DAT1: RESULT Mask              */

#define EADC_DAT1_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT1: OV Position              */
#define EADC_DAT1_OV_Msk             ( 0x1ul << EADC_DAT1_OV_Pos )                         /*!< EADC_T::DAT1: OV Mask                  */

#define EADC_DAT1_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT1: VALID Position           */
#define EADC_DAT1_VALID_Msk          ( 0x1ul << EADC_DAT1_VALID_Pos )                      /*!< EADC_T::DAT1: VALID Mask               */

#define EADC_DAT2_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT2: RESULT Position          */
#define EADC_DAT2_RESULT_Msk         ( 0xfffful << EADC_DAT2_RESULT_Pos )                  /*!< EADC_T::DAT2: RESULT Mask              */

#define EADC_DAT2_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT2: OV Position              */
#define EADC_DAT2_OV_Msk             ( 0x1ul << EADC_DAT2_OV_Pos )                         /*!< EADC_T::DAT2: OV Mask                  */

#define EADC_DAT2_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT2: VALID Position           */
#define EADC_DAT2_VALID_Msk          ( 0x1ul << EADC_DAT2_VALID_Pos )                      /*!< EADC_T::DAT2: VALID Mask               */

#define EADC_DAT3_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT3: RESULT Position          */
#define EADC_DAT3_RESULT_Msk         ( 0xfffful << EADC_DAT3_RESULT_Pos )                  /*!< EADC_T::DAT3: RESULT Mask              */

#define EADC_DAT3_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT3: OV Position              */
#define EADC_DAT3_OV_Msk             ( 0x1ul << EADC_DAT3_OV_Pos )                         /*!< EADC_T::DAT3: OV Mask                  */

#define EADC_DAT3_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT3: VALID Position           */
#define EADC_DAT3_VALID_Msk          ( 0x1ul << EADC_DAT3_VALID_Pos )                      /*!< EADC_T::DAT3: VALID Mask               */

#define EADC_DAT4_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT4: RESULT Position          */
#define EADC_DAT4_RESULT_Msk         ( 0xfffful << EADC_DAT4_RESULT_Pos )                  /*!< EADC_T::DAT4: RESULT Mask              */

#define EADC_DAT4_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT4: OV Position              */
#define EADC_DAT4_OV_Msk             ( 0x1ul << EADC_DAT4_OV_Pos )                         /*!< EADC_T::DAT4: OV Mask                  */

#define EADC_DAT4_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT4: VALID Position           */
#define EADC_DAT4_VALID_Msk          ( 0x1ul << EADC_DAT4_VALID_Pos )                      /*!< EADC_T::DAT4: VALID Mask               */

#define EADC_DAT5_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT5: RESULT Position          */
#define EADC_DAT5_RESULT_Msk         ( 0xfffful << EADC_DAT5_RESULT_Pos )                  /*!< EADC_T::DAT5: RESULT Mask              */

#define EADC_DAT5_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT5: OV Position              */
#define EADC_DAT5_OV_Msk             ( 0x1ul << EADC_DAT5_OV_Pos )                         /*!< EADC_T::DAT5: OV Mask                  */

#define EADC_DAT5_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT5: VALID Position           */
#define EADC_DAT5_VALID_Msk          ( 0x1ul << EADC_DAT5_VALID_Pos )                      /*!< EADC_T::DAT5: VALID Mask               */

#define EADC_DAT6_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT6: RESULT Position          */
#define EADC_DAT6_RESULT_Msk         ( 0xfffful << EADC_DAT6_RESULT_Pos )                  /*!< EADC_T::DAT6: RESULT Mask              */

#define EADC_DAT6_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT6: OV Position              */
#define EADC_DAT6_OV_Msk             ( 0x1ul << EADC_DAT6_OV_Pos )                         /*!< EADC_T::DAT6: OV Mask                  */

#define EADC_DAT6_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT6: VALID Position           */
#define EADC_DAT6_VALID_Msk          ( 0x1ul << EADC_DAT6_VALID_Pos )                      /*!< EADC_T::DAT6: VALID Mask               */

