FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_DAT7_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT7: RESULT Position          */
#define EADC_DAT7_RESULT_Msk         ( 0xfffful << EADC_DAT7_RESULT_Pos )                  /*!< EADC_T::DAT7: RESULT Mask              */

#define EADC_DAT7_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT7: OV Position              */
#define EADC_DAT7_OV_Msk             ( 0x1ul << EADC_DAT7_OV_Pos )                         /*!< EADC_T::DAT7: OV Mask                  */

#define EADC_DAT7_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT7: VALID Position           */
#define EADC_DAT7_VALID_Msk          ( 0x1ul << EADC_DAT7_VALID_Pos )                      /*!< EADC_T::DAT7: VALID Mask               */

#define EADC_DAT8_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT8: RESULT Position          */
#define EADC_DAT8_RESULT_Msk         ( 0xfffful << EADC_DAT8_RESULT_Pos )                  /*!< EADC_T::DAT8: RESULT Mask              */

#define EADC_DAT8_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT8: OV Position              */
#define EADC_DAT8_OV_Msk             ( 0x1ul << EADC_DAT8_OV_Pos )                         /*!< EADC_T::DAT8: OV Mask                  */

#define EADC_DAT8_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT8: VALID Position           */
#define EADC_DAT8_VALID_Msk          ( 0x1ul << EADC_DAT8_VALID_Pos )                      /*!< EADC_T::DAT8: VALID Mask               */

#define EADC_DAT9_RESULT_Pos         ( 0 )                                                 /*!< EADC_T::DAT9: RESULT Position          */
#define EADC_DAT9_RESULT_Msk         ( 0xfffful << EADC_DAT9_RESULT_Pos )                  /*!< EADC_T::DAT9: RESULT Mask              */

#define EADC_DAT9_OV_Pos             ( 16 )                                                /*!< EADC_T::DAT9: OV Position              */
#define EADC_DAT9_OV_Msk             ( 0x1ul << EADC_DAT9_OV_Pos )                         /*!< EADC_T::DAT9: OV Mask                  */

#define EADC_DAT9_VALID_Pos          ( 17 )                                                /*!< EADC_T::DAT9: VALID Position           */
#define EADC_DAT9_VALID_Msk          ( 0x1ul << EADC_DAT9_VALID_Pos )                      /*!< EADC_T::DAT9: VALID Mask               */

#define EADC_DAT10_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DAT10: RESULT Position         */
#define EADC_DAT10_RESULT_Msk        ( 0xfffful << EADC_DAT10_RESULT_Pos )                 /*!< EADC_T::DAT10: RESULT Mask             */

#define EADC_DAT10_OV_Pos            ( 16 )                                                /*!< EADC_T::DAT10: OV Position             */
#define EADC_DAT10_OV_Msk            ( 0x1ul << EADC_DAT10_OV_Pos )                        /*!< EADC_T::DAT10: OV Mask                 */

#define EADC_DAT10_VALID_Pos         ( 17 )                                                /*!< EADC_T::DAT10: VALID Position          */
#define EADC_DAT10_VALID_Msk         ( 0x1ul << EADC_DAT10_VALID_Pos )                     /*!< EADC_T::DAT10: VALID Mask              */

#define EADC_DAT11_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DAT11: RESULT Position         */
#define EADC_DAT11_RESULT_Msk        ( 0xfffful << EADC_DAT11_RESULT_Pos )                 /*!< EADC_T::DAT11: RESULT Mask             */

#define EADC_DAT11_OV_Pos            ( 16 )                                                /*!< EADC_T::DAT11: OV Position             */
#define EADC_DAT11_OV_Msk            ( 0x1ul << EADC_DAT11_OV_Pos )                        /*!< EADC_T::DAT11: OV Mask                 */

#define EADC_DAT11_VALID_Pos         ( 17 )                                                /*!< EADC_T::DAT11: VALID Position          */
#define EADC_DAT11_VALID_Msk         ( 0x1ul << EADC_DAT11_VALID_Pos )                     /*!< EADC_T::DAT11: VALID Mask              */

#define EADC_DAT12_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DAT12: RESULT Position         */
#define EADC_DAT12_RESULT_Msk        ( 0xfffful << EADC_DAT12_RESULT_Pos )                 /*!< EADC_T::DAT12: RESULT Mask             */

#define EADC_DAT12_OV_Pos            ( 16 )                                                /*!< EADC_T::DAT12: OV Position             */
#define EADC_DAT12_OV_Msk            ( 0x1ul << EADC_DAT12_OV_Pos )                        /*!< EADC_T::DAT12: OV Mask                 */

#define EADC_DAT12_VALID_Pos         ( 17 )                                                /*!< EADC_T::DAT12: VALID Position          */
#define EADC_DAT12_VALID_Msk         ( 0x1ul << EADC_DAT12_VALID_Pos )                     /*!< EADC_T::DAT12: VALID Mask              */

#define EADC_DAT13_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DAT13: RESULT Position         */
#define EADC_DAT13_RESULT_Msk        ( 0xfffful << EADC_DAT13_RESULT_Pos )                 /*!< EADC_T::DAT13: RESULT Mask             */

#define EADC_DAT13_OV_Pos            ( 16 )                                                /*!< EADC_T::DAT13: OV Position             */
#define EADC_DAT13_OV_Msk            ( 0x1ul << EADC_DAT13_OV_Pos )                        /*!< EADC_T::DAT13: OV Mask                 */

#define EADC_DAT13_VALID_Pos         ( 17 )                                                /*!< EADC_T::DAT13: VALID Position          */
#define EADC_DAT13_VALID_Msk         ( 0x1ul << EADC_DAT13_VALID_Pos )                     /*!< EADC_T::DAT13: VALID Mask              */

#define EADC_DAT14_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DAT14: RESULT Position         */
#define EADC_DAT14_RESULT_Msk        ( 0xfffful << EADC_DAT14_RESULT_Pos )                 /*!< EADC_T::DAT14: RESULT Mask             */

#define EADC_DAT14_OV_Pos            ( 16 )                                                /*!< EADC_T::DAT14: OV Position             */
#define EADC_DAT14_OV_Msk            ( 0x1ul << EADC_DAT14_OV_Pos )                        /*!< EADC_T::DAT14: OV Mask                 */

#define EADC_DAT14_VALID_Pos         ( 17 )                                                /*!< EADC_T::DAT14: VALID Position          */
#define EADC_DAT14_VALID_Msk         ( 0x1ul << EADC_DAT14_VALID_Pos )                     /*!< EADC_T::DAT14: VALID Mask              */

