FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_DAT15_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DAT15: RESULT Position         */
#define EADC_DAT15_RESULT_Msk        ( 0xfffful << EADC_DAT15_RESULT_Pos )                 /*!< EADC_T::DAT15: RESULT Mask             */

#define EADC_DAT15_OV_Pos            ( 16 )                                                /*!< EADC_T::DAT15: OV Position             */
#define EADC_DAT15_OV_Msk            ( 0x1ul << EADC_DAT15_OV_Pos )                        /*!< EADC_T::DAT15: OV Mask                 */

#define EADC_DAT15_VALID_Pos         ( 17 )                                                /*!< EADC_T::DAT15: VALID Position          */
#define EADC_DAT15_VALID_Msk         ( 0x1ul << EADC_DAT15_VALID_Pos )                     /*!< EADC_T::DAT15: VALID Mask              */

#define EADC_DAT16_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DAT16: RESULT Position         */
#define EADC_DAT16_RESULT_Msk        ( 0xfffful << EADC_DAT16_RESULT_Pos )                 /*!< EADC_T::DAT16: RESULT Mask             */

#define EADC_DAT16_OV_Pos            ( 16 )                                                /*!< EADC_T::DAT16: OV Position             */
#define EADC_DAT16_OV_Msk            ( 0x1ul << EADC_DAT16_OV_Pos )                        /*!< EADC_T::DAT16: OV Mask                 */

#define EADC_DAT16_VALID_Pos         ( 17 )                                                /*!< EADC_T::DAT16: VALID Position          */
#define EADC_DAT16_VALID_Msk         ( 0x1ul << EADC_DAT16_VALID_Pos )                     /*!< EADC_T::DAT16: VALID Mask              */

#define EADC_DAT17_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DAT17: RESULT Position         */
#define EADC_DAT17_RESULT_Msk        ( 0xfffful << EADC_DAT17_RESULT_Pos )                 /*!< EADC_T::DAT17: RESULT Mask             */

#define EADC_DAT17_OV_Pos            ( 16 )                                                /*!< EADC_T::DAT17: OV Position             */
#define EADC_DAT17_OV_Msk            ( 0x1ul << EADC_DAT17_OV_Pos )                        /*!< EADC_T::DAT17: OV Mask                 */

#define EADC_DAT17_VALID_Pos         ( 17 )                                                /*!< EADC_T::DAT17: VALID Position          */
#define EADC_DAT17_VALID_Msk         ( 0x1ul << EADC_DAT17_VALID_Pos )                     /*!< EADC_T::DAT17: VALID Mask              */

#define EADC_DAT18_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DAT18: RESULT Position         */
#define EADC_DAT18_RESULT_Msk        ( 0xfffful << EADC_DAT18_RESULT_Pos )                 /*!< EADC_T::DAT18: RESULT Mask             */

#define EADC_DAT18_OV_Pos            ( 16 )                                                /*!< EADC_T::DAT18: OV Position             */
#define EADC_DAT18_OV_Msk            ( 0x1ul << EADC_DAT18_OV_Pos )                        /*!< EADC_T::DAT18: OV Mask                 */

#define EADC_DAT18_VALID_Pos         ( 17 )                                                /*!< EADC_T::DAT18: VALID Position          */
#define EADC_DAT18_VALID_Msk         ( 0x1ul << EADC_DAT18_VALID_Pos )                     /*!< EADC_T::DAT18: VALID Mask              */

#define EADC_CURDAT_CURDAT_Pos       ( 0 )                                                 /*!< EADC_T::CURDAT: CURDAT Position        */
#define EADC_CURDAT_CURDAT_Msk       ( 0x3fffful << EADC_CURDAT_CURDAT_Pos )               /*!< EADC_T::CURDAT: CURDAT Mask            */

#define EADC_CTL_ADCEN_Pos           ( 0 )                                                 /*!< EADC_T::CTL: ADCEN Position            */
#define EADC_CTL_ADCEN_Msk           ( 0x1ul << EADC_CTL_ADCEN_Pos )                       /*!< EADC_T::CTL: ADCEN Mask                */

#define EADC_CTL_ADCRST_Pos          ( 1 )                                                 /*!< EADC_T::CTL: ADCRST Position           */
#define EADC_CTL_ADCRST_Msk          ( 0x1ul << EADC_CTL_ADCRST_Pos )                      /*!< EADC_T::CTL: ADCRST Mask               */

#define EADC_CTL_ADCIEN0_Pos         ( 2 )                                                 /*!< EADC_T::CTL: ADCIEN0 Position          */
#define EADC_CTL_ADCIEN0_Msk         ( 0x1ul << EADC_CTL_ADCIEN0_Pos )                     /*!< EADC_T::CTL: ADCIEN0 Mask              */

#define EADC_CTL_ADCIEN1_Pos         ( 3 )                                                 /*!< EADC_T::CTL: ADCIEN1 Position          */
#define EADC_CTL_ADCIEN1_Msk         ( 0x1ul << EADC_CTL_ADCIEN1_Pos )                     /*!< EADC_T::CTL: ADCIEN1 Mask              */

#define EADC_CTL_ADCIEN2_Pos         ( 4 )                                                 /*!< EADC_T::CTL: ADCIEN2 Position          */
#define EADC_CTL_ADCIEN2_Msk         ( 0x1ul << EADC_CTL_ADCIEN2_Pos )                     /*!< EADC_T::CTL: ADCIEN2 Mask              */

#define EADC_CTL_ADCIEN3_Pos         ( 5 )                                                 /*!< EADC_T::CTL: ADCIEN3 Position          */
#define EADC_CTL_ADCIEN3_Msk         ( 0x1ul << EADC_CTL_ADCIEN3_Pos )                     /*!< EADC_T::CTL: ADCIEN3 Mask              */

#define EADC_CTL_RESSEL_Pos          ( 6 )                                                 /*!< EADC_T::CTL: RESSEL Position           */
#define EADC_CTL_RESSEL_Msk          ( 0x3ul << EADC_CTL_RESSEL_Pos )                      /*!< EADC_T::CTL: RESSEL Mask               */

#define EADC_CTL_DIFFEN_Pos          ( 8 )                                                 /*!< EADC_T::CTL: DIFFEN Position           */
#define EADC_CTL_DIFFEN_Msk          ( 0x1ul << EADC_CTL_DIFFEN_Pos )                      /*!< EADC_T::CTL: DIFFEN Mask               */

#define EADC_CTL_DMOF_Pos            ( 9 )                                                 /*!< EADC_T::CTL: DMOF Position             */
#define EADC_CTL_DMOF_Msk            ( 0x1ul << EADC_CTL_DMOF_Pos )                        /*!< EADC_T::CTL: DMOF Mask                 */

#define EADC_CTL_PDMAEN_Pos          ( 11 )                                                /*!< EADC_T::CTL: PDMAEN Position           */
#define EADC_CTL_PDMAEN_Msk          ( 0x1ul << EADC_CTL_PDMAEN_Pos )                      /*!< EADC_T::CTL: PDMAEN Mask               */

#define EADC_SWTRG_SWTRG_Pos         ( 0 )                                                 /*!< EADC_T::SWTRG: SWTRG Position          */
#define EADC_SWTRG_SWTRG_Msk         ( 0x7fffful << EADC_SWTRG_SWTRG_Pos )                 /*!< EADC_T::SWTRG: SWTRG Mask              */

#define EADC_PENDSTS_STPF_Pos        ( 0 )                                                 /*!< EADC_T::PENDSTS: STPF Position         */
#define EADC_PENDSTS_STPF_Msk        ( 0x7fffful << EADC_PENDSTS_STPF_Pos )                /*!< EADC_T::PENDSTS: STPF Mask             */

