FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_OVSTS_SPOVF_Pos         ( 0 )                                                 /*!< EADC_T::OVSTS: SPOVF Position          */
#define EADC_OVSTS_SPOVF_Msk         ( 0x7fffful << EADC_OVSTS_SPOVF_Pos )                 /*!< EADC_T::OVSTS: SPOVF Mask              */

#define EADC_SCTL_CHSEL_Pos          ( 0 )                                                 /*!< EADC_T::SCTL: CHSEL Position           */
#define EADC_SCTL_CHSEL_Msk          ( 0xful << EADC_SCTL_CHSEL_Pos )                      /*!< EADC_T::SCTL: CHSEL Mask               */

#define EADC_SCTL_EXTREN_Pos         ( 4 )                                                 /*!< EADC_T::SCTL: EXTREN Position          */
#define EADC_SCTL_EXTREN_Msk         ( 0x1ul << EADC_SCTL_EXTREN_Pos )                     /*!< EADC_T::SCTL: EXTREN Mask              */

#define EADC_SCTL_EXTFEN_Pos         ( 5 )                                                 /*!< EADC_T::SCTL: EXTFEN Position          */
#define EADC_SCTL_EXTFEN_Msk         ( 0x1ul << EADC_SCTL_EXTFEN_Pos )                     /*!< EADC_T::SCTL: EXTFEN Mask              */

#define EADC_SCTL_TRGDLYDIV_Pos      ( 6 )                                                 /*!< EADC_T::SCTL: TRGDLYDIV Position       */
#define EADC_SCTL_TRGDLYDIV_Msk      ( 0x3ul << EADC_SCTL_TRGDLYDIV_Pos )                  /*!< EADC_T::SCTL: TRGDLYDIV Mask           */

#define EADC_SCTL_TRGDLYCNT_Pos      ( 8 )                                                 /*!< EADC_T::SCTL: TRGDLYCNT Position       */
#define EADC_SCTL_TRGDLYCNT_Msk      ( 0xfful << EADC_SCTL_TRGDLYCNT_Pos )                 /*!< EADC_T::SCTL: TRGDLYCNT Mask           */

#define EADC_SCTL_TRGSEL_Pos         ( 16 )                                                /*!< EADC_T::SCTL: TRGSEL Position          */
#define EADC_SCTL_TRGSEL_Msk         ( 0x1ful << EADC_SCTL_TRGSEL_Pos )                    /*!< EADC_T::SCTL: TRGSEL Mask              */

#define EADC_SCTL_INTPOS_Pos         ( 22 )                                                /*!< EADC_T::SCTL: INTPOS Position          */
#define EADC_SCTL_INTPOS_Msk         ( 0x1ul << EADC_SCTL_INTPOS_Pos )                     /*!< EADC_T::SCTL: INTPOS Mask              */

#define EADC_SCTL_DBMEN_Pos          ( 23 )                                                /*!< EADC_T::SCTL: DBMEN Position           */
#define EADC_SCTL_DBMEN_Msk          ( 0x1ul << EADC_SCTL_DBMEN_Pos )                      /*!< EADC_T::SCTL: DBMEN Mask               */

#define EADC_SCTL_EXTSMPT_Pos        ( 24 )                                                /*!< EADC_T::SCTL: EXTSMPT Position         */
#define EADC_SCTL_EXTSMPT_Msk        ( 0xfful << EADC_SCTL_EXTSMPT_Pos )                   /*!< EADC_T::SCTL: EXTSMPT Mask             */

#define EADC_SCTL0_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL0: CHSEL Position          */
#define EADC_SCTL0_CHSEL_Msk         ( 0xful << EADC_SCTL0_CHSEL_Pos )                     /*!< EADC_T::SCTL0: CHSEL Mask              */

#define EADC_SCTL0_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL0: EXTREN Position         */
#define EADC_SCTL0_EXTREN_Msk        ( 0x1ul << EADC_SCTL0_EXTREN_Pos )                    /*!< EADC_T::SCTL0: EXTREN Mask             */

#define EADC_SCTL0_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL0: EXTFEN Position         */
#define EADC_SCTL0_EXTFEN_Msk        ( 0x1ul << EADC_SCTL0_EXTFEN_Pos )                    /*!< EADC_T::SCTL0: EXTFEN Mask             */

#define EADC_SCTL0_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL0: TRGDLYDIV Position      */
#define EADC_SCTL0_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL0_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL0: TRGDLYDIV Mask          */

#define EADC_SCTL0_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL0: TRGDLYCNT Position      */
#define EADC_SCTL0_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL0_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL0: TRGDLYCNT Mask          */

#define EADC_SCTL0_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL0: TRGSEL Position         */
#define EADC_SCTL0_TRGSEL_Msk        ( 0x1ful << EADC_SCTL0_TRGSEL_Pos )                   /*!< EADC_T::SCTL0: TRGSEL Mask             */

#define EADC_SCTL0_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL0: INTPOS Position         */
#define EADC_SCTL0_INTPOS_Msk        ( 0x1ul << EADC_SCTL0_INTPOS_Pos )                    /*!< EADC_T::SCTL0: INTPOS Mask             */

#define EADC_SCTL0_DBMEN_Pos         ( 23 )                                                /*!< EADC_T::SCTL0: DBMEN Position          */
#define EADC_SCTL0_DBMEN_Msk         ( 0x1ul << EADC_SCTL0_DBMEN_Pos )                     /*!< EADC_T::SCTL0: DBMEN Mask              */

#define EADC_SCTL0_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL0: EXTSMPT Position        */
#define EADC_SCTL0_EXTSMPT_Msk       ( 0xfful << EADC_SCTL0_EXTSMPT_Pos )                  /*!< EADC_T::SCTL0: EXTSMPT Mask            */

#define EADC_SCTL1_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL1: CHSEL Position          */
#define EADC_SCTL1_CHSEL_Msk         ( 0xful << EADC_SCTL1_CHSEL_Pos )                     /*!< EADC_T::SCTL1: CHSEL Mask              */

#define EADC_SCTL1_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL1: EXTREN Position         */
#define EADC_SCTL1_EXTREN_Msk        ( 0x1ul << EADC_SCTL1_EXTREN_Pos )                    /*!< EADC_T::SCTL1: EXTREN Mask             */

#define EADC_SCTL1_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL1: EXTFEN Position         */
#define EADC_SCTL1_EXTFEN_Msk        ( 0x1ul << EADC_SCTL1_EXTFEN_Pos )                    /*!< EADC_T::SCTL1: EXTFEN Mask             */

