FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_SCTL1_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL1: TRGDLYDIV Position      */
#define EADC_SCTL1_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL1_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL1: TRGDLYDIV Mask          */

#define EADC_SCTL1_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL1: TRGDLYCNT Position      */
#define EADC_SCTL1_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL1_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL1: TRGDLYCNT Mask          */

#define EADC_SCTL1_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL1: TRGSEL Position         */
#define EADC_SCTL1_TRGSEL_Msk        ( 0x1ful << EADC_SCTL1_TRGSEL_Pos )                   /*!< EADC_T::SCTL1: TRGSEL Mask             */

#define EADC_SCTL1_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL1: INTPOS Position         */
#define EADC_SCTL1_INTPOS_Msk        ( 0x1ul << EADC_SCTL1_INTPOS_Pos )                    /*!< EADC_T::SCTL1: INTPOS Mask             */

#define EADC_SCTL1_DBMEN_Pos         ( 23 )                                                /*!< EADC_T::SCTL1: DBMEN Position          */
#define EADC_SCTL1_DBMEN_Msk         ( 0x1ul << EADC_SCTL1_DBMEN_Pos )                     /*!< EADC_T::SCTL1: DBMEN Mask              */

#define EADC_SCTL1_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL1: EXTSMPT Position        */
#define EADC_SCTL1_EXTSMPT_Msk       ( 0xfful << EADC_SCTL1_EXTSMPT_Pos )                  /*!< EADC_T::SCTL1: EXTSMPT Mask            */

#define EADC_SCTL2_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL2: CHSEL Position          */
#define EADC_SCTL2_CHSEL_Msk         ( 0xful << EADC_SCTL2_CHSEL_Pos )                     /*!< EADC_T::SCTL2: CHSEL Mask              */

#define EADC_SCTL2_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL2: EXTREN Position         */
#define EADC_SCTL2_EXTREN_Msk        ( 0x1ul << EADC_SCTL2_EXTREN_Pos )                    /*!< EADC_T::SCTL2: EXTREN Mask             */

#define EADC_SCTL2_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL2: EXTFEN Position         */
#define EADC_SCTL2_EXTFEN_Msk        ( 0x1ul << EADC_SCTL2_EXTFEN_Pos )                    /*!< EADC_T::SCTL2: EXTFEN Mask             */

#define EADC_SCTL2_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL2: TRGDLYDIV Position      */
#define EADC_SCTL2_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL2_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL2: TRGDLYDIV Mask          */

#define EADC_SCTL2_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL2: TRGDLYCNT Position      */
#define EADC_SCTL2_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL2_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL2: TRGDLYCNT Mask          */

#define EADC_SCTL2_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL2: TRGSEL Position         */
#define EADC_SCTL2_TRGSEL_Msk        ( 0x1ful << EADC_SCTL2_TRGSEL_Pos )                   /*!< EADC_T::SCTL2: TRGSEL Mask             */

#define EADC_SCTL2_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL2: INTPOS Position         */
#define EADC_SCTL2_INTPOS_Msk        ( 0x1ul << EADC_SCTL2_INTPOS_Pos )                    /*!< EADC_T::SCTL2: INTPOS Mask             */

#define EADC_SCTL2_DBMEN_Pos         ( 23 )                                                /*!< EADC_T::SCTL2: DBMEN Position          */
#define EADC_SCTL2_DBMEN_Msk         ( 0x1ul << EADC_SCTL2_DBMEN_Pos )                     /*!< EADC_T::SCTL2: DBMEN Mask              */

#define EADC_SCTL2_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL2: EXTSMPT Position        */
#define EADC_SCTL2_EXTSMPT_Msk       ( 0xfful << EADC_SCTL2_EXTSMPT_Pos )                  /*!< EADC_T::SCTL2: EXTSMPT Mask            */

#define EADC_SCTL3_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL3: CHSEL Position          */
#define EADC_SCTL3_CHSEL_Msk         ( 0xful << EADC_SCTL3_CHSEL_Pos )                     /*!< EADC_T::SCTL3: CHSEL Mask              */

#define EADC_SCTL3_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL3: EXTREN Position         */
#define EADC_SCTL3_EXTREN_Msk        ( 0x1ul << EADC_SCTL3_EXTREN_Pos )                    /*!< EADC_T::SCTL3: EXTREN Mask             */

#define EADC_SCTL3_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL3: EXTFEN Position         */
#define EADC_SCTL3_EXTFEN_Msk        ( 0x1ul << EADC_SCTL3_EXTFEN_Pos )                    /*!< EADC_T::SCTL3: EXTFEN Mask             */

#define EADC_SCTL3_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL3: TRGDLYDIV Position      */
#define EADC_SCTL3_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL3_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL3: TRGDLYDIV Mask          */

#define EADC_SCTL3_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL3: TRGDLYCNT Position      */
#define EADC_SCTL3_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL3_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL3: TRGDLYCNT Mask          */

#define EADC_SCTL3_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL3: TRGSEL Position         */
#define EADC_SCTL3_TRGSEL_Msk        ( 0x1ful << EADC_SCTL3_TRGSEL_Pos )                   /*!< EADC_T::SCTL3: TRGSEL Mask             */

#define EADC_SCTL3_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL3: INTPOS Position         */
#define EADC_SCTL3_INTPOS_Msk        ( 0x1ul << EADC_SCTL3_INTPOS_Pos )                    /*!< EADC_T::SCTL3: INTPOS Mask             */

#define EADC_SCTL3_DBMEN_Pos         ( 23 )                                                /*!< EADC_T::SCTL3: DBMEN Position          */
#define EADC_SCTL3_DBMEN_Msk         ( 0x1ul << EADC_SCTL3_DBMEN_Pos )                     /*!< EADC_T::SCTL3: DBMEN Mask              */

