FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_SCTL3_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL3: EXTSMPT Position        */
#define EADC_SCTL3_EXTSMPT_Msk       ( 0xfful << EADC_SCTL3_EXTSMPT_Pos )                  /*!< EADC_T::SCTL3: EXTSMPT Mask            */

#define EADC_SCTL4_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL4: CHSEL Position          */
#define EADC_SCTL4_CHSEL_Msk         ( 0xful << EADC_SCTL4_CHSEL_Pos )                     /*!< EADC_T::SCTL4: CHSEL Mask              */

#define EADC_SCTL4_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL4: EXTREN Position         */
#define EADC_SCTL4_EXTREN_Msk        ( 0x1ul << EADC_SCTL4_EXTREN_Pos )                    /*!< EADC_T::SCTL4: EXTREN Mask             */

#define EADC_SCTL4_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL4: EXTFEN Position         */
#define EADC_SCTL4_EXTFEN_Msk        ( 0x1ul << EADC_SCTL4_EXTFEN_Pos )                    /*!< EADC_T::SCTL4: EXTFEN Mask             */

#define EADC_SCTL4_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL4: TRGDLYDIV Position      */
#define EADC_SCTL4_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL4_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL4: TRGDLYDIV Mask          */

#define EADC_SCTL4_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL4: TRGDLYCNT Position      */
#define EADC_SCTL4_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL4_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL4: TRGDLYCNT Mask          */

#define EADC_SCTL4_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL4: TRGSEL Position         */
#define EADC_SCTL4_TRGSEL_Msk        ( 0x1ful << EADC_SCTL4_TRGSEL_Pos )                   /*!< EADC_T::SCTL4: TRGSEL Mask             */

#define EADC_SCTL4_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL4: INTPOS Position         */
#define EADC_SCTL4_INTPOS_Msk        ( 0x1ul << EADC_SCTL4_INTPOS_Pos )                    /*!< EADC_T::SCTL4: INTPOS Mask             */

#define EADC_SCTL4_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL4: EXTSMPT Position        */
#define EADC_SCTL4_EXTSMPT_Msk       ( 0xfful << EADC_SCTL4_EXTSMPT_Pos )                  /*!< EADC_T::SCTL4: EXTSMPT Mask            */

#define EADC_SCTL5_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL5: CHSEL Position          */
#define EADC_SCTL5_CHSEL_Msk         ( 0xful << EADC_SCTL5_CHSEL_Pos )                     /*!< EADC_T::SCTL5: CHSEL Mask              */

#define EADC_SCTL5_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL5: EXTREN Position         */
#define EADC_SCTL5_EXTREN_Msk        ( 0x1ul << EADC_SCTL5_EXTREN_Pos )                    /*!< EADC_T::SCTL5: EXTREN Mask             */

#define EADC_SCTL5_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL5: EXTFEN Position         */
#define EADC_SCTL5_EXTFEN_Msk        ( 0x1ul << EADC_SCTL5_EXTFEN_Pos )                    /*!< EADC_T::SCTL5: EXTFEN Mask             */

#define EADC_SCTL5_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL5: TRGDLYDIV Position      */
#define EADC_SCTL5_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL5_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL5: TRGDLYDIV Mask          */

#define EADC_SCTL5_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL5: TRGDLYCNT Position      */
#define EADC_SCTL5_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL5_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL5: TRGDLYCNT Mask          */

#define EADC_SCTL5_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL5: TRGSEL Position         */
#define EADC_SCTL5_TRGSEL_Msk        ( 0x1ful << EADC_SCTL5_TRGSEL_Pos )                   /*!< EADC_T::SCTL5: TRGSEL Mask             */

#define EADC_SCTL5_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL5: INTPOS Position         */
#define EADC_SCTL5_INTPOS_Msk        ( 0x1ul << EADC_SCTL5_INTPOS_Pos )                    /*!< EADC_T::SCTL5: INTPOS Mask             */

#define EADC_SCTL5_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL5: EXTSMPT Position        */
#define EADC_SCTL5_EXTSMPT_Msk       ( 0xfful << EADC_SCTL5_EXTSMPT_Pos )                  /*!< EADC_T::SCTL5: EXTSMPT Mask            */

#define EADC_SCTL6_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL6: CHSEL Position          */
#define EADC_SCTL6_CHSEL_Msk         ( 0xful << EADC_SCTL6_CHSEL_Pos )                     /*!< EADC_T::SCTL6: CHSEL Mask              */

#define EADC_SCTL6_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL6: EXTREN Position         */
#define EADC_SCTL6_EXTREN_Msk        ( 0x1ul << EADC_SCTL6_EXTREN_Pos )                    /*!< EADC_T::SCTL6: EXTREN Mask             */

#define EADC_SCTL6_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL6: EXTFEN Position         */
#define EADC_SCTL6_EXTFEN_Msk        ( 0x1ul << EADC_SCTL6_EXTFEN_Pos )                    /*!< EADC_T::SCTL6: EXTFEN Mask             */

#define EADC_SCTL6_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL6: TRGDLYDIV Position      */
#define EADC_SCTL6_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL6_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL6: TRGDLYDIV Mask          */

#define EADC_SCTL6_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL6: TRGDLYCNT Position      */
#define EADC_SCTL6_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL6_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL6: TRGDLYCNT Mask          */

#define EADC_SCTL6_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL6: TRGSEL Position         */
#define EADC_SCTL6_TRGSEL_Msk        ( 0x1ful << EADC_SCTL6_TRGSEL_Pos )                   /*!< EADC_T::SCTL6: TRGSEL Mask             */

#define EADC_SCTL6_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL6: INTPOS Position         */
#define EADC_SCTL6_INTPOS_Msk        ( 0x1ul << EADC_SCTL6_INTPOS_Pos )                    /*!< EADC_T::SCTL6: INTPOS Mask             */

#define EADC_SCTL6_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL6: EXTSMPT Position        */
#define EADC_SCTL6_EXTSMPT_Msk       ( 0xfful << EADC_SCTL6_EXTSMPT_Pos )                  /*!< EADC_T::SCTL6: EXTSMPT Mask            */

#define EADC_SCTL7_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL7: CHSEL Position          */
#define EADC_SCTL7_CHSEL_Msk         ( 0xful << EADC_SCTL7_CHSEL_Pos )                     /*!< EADC_T::SCTL7: CHSEL Mask              */

#define EADC_SCTL7_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL7: EXTREN Position         */
#define EADC_SCTL7_EXTREN_Msk        ( 0x1ul << EADC_SCTL7_EXTREN_Pos )                    /*!< EADC_T::SCTL7: EXTREN Mask             */

#define EADC_SCTL7_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL7: EXTFEN Position         */
#define EADC_SCTL7_EXTFEN_Msk        ( 0x1ul << EADC_SCTL7_EXTFEN_Pos )                    /*!< EADC_T::SCTL7: EXTFEN Mask             */

#define EADC_SCTL7_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL7: TRGDLYDIV Position      */
#define EADC_SCTL7_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL7_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL7: TRGDLYDIV Mask          */

#define EADC_SCTL7_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL7: TRGDLYCNT Position      */
#define EADC_SCTL7_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL7_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL7: TRGDLYCNT Mask          */

#define EADC_SCTL7_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL7: TRGSEL Position         */
#define EADC_SCTL7_TRGSEL_Msk        ( 0x1ful << EADC_SCTL7_TRGSEL_Pos )                   /*!< EADC_T::SCTL7: TRGSEL Mask             */

#define EADC_SCTL7_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL7: INTPOS Position         */
#define EADC_SCTL7_INTPOS_Msk        ( 0x1ul << EADC_SCTL7_INTPOS_Pos )                    /*!< EADC_T::SCTL7: INTPOS Mask             */

#define EADC_SCTL7_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL7: EXTSMPT Position        */
#define EADC_SCTL7_EXTSMPT_Msk       ( 0xfful << EADC_SCTL7_EXTSMPT_Pos )                  /*!< EADC_T::SCTL7: EXTSMPT Mask            */

#define EADC_SCTL8_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL8: CHSEL Position          */
#define EADC_SCTL8_CHSEL_Msk         ( 0xful << EADC_SCTL8_CHSEL_Pos )                     /*!< EADC_T::SCTL8: CHSEL Mask              */

#define EADC_SCTL8_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL8: EXTREN Position         */
#define EADC_SCTL8_EXTREN_Msk        ( 0x1ul << EADC_SCTL8_EXTREN_Pos )                    /*!< EADC_T::SCTL8: EXTREN Mask             */

#define EADC_SCTL8_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL8: EXTFEN Position         */
#define EADC_SCTL8_EXTFEN_Msk        ( 0x1ul << EADC_SCTL8_EXTFEN_Pos )                    /*!< EADC_T::SCTL8: EXTFEN Mask             */

#define EADC_SCTL8_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL8: TRGDLYDIV Position      */
#define EADC_SCTL8_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL8_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL8: TRGDLYDIV Mask          */

#define EADC_SCTL8_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL8: TRGDLYCNT Position      */
#define EADC_SCTL8_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL8_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL8: TRGDLYCNT Mask          */

#define EADC_SCTL8_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL8: TRGSEL Position         */
#define EADC_SCTL8_TRGSEL_Msk        ( 0x1ful << EADC_SCTL8_TRGSEL_Pos )                   /*!< EADC_T::SCTL8: TRGSEL Mask             */

#define EADC_SCTL8_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL8: INTPOS Position         */
#define EADC_SCTL8_INTPOS_Msk        ( 0x1ul << EADC_SCTL8_INTPOS_Pos )                    /*!< EADC_T::SCTL8: INTPOS Mask             */

#define EADC_SCTL8_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL8: EXTSMPT Position        */
#define EADC_SCTL8_EXTSMPT_Msk       ( 0xfful << EADC_SCTL8_EXTSMPT_Pos )                  /*!< EADC_T::SCTL8: EXTSMPT Mask            */

#define EADC_SCTL9_CHSEL_Pos         ( 0 )                                                 /*!< EADC_T::SCTL9: CHSEL Position          */
#define EADC_SCTL9_CHSEL_Msk         ( 0xful << EADC_SCTL9_CHSEL_Pos )                     /*!< EADC_T::SCTL9: CHSEL Mask              */

