FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_SCTL9_EXTREN_Pos        ( 4 )                                                 /*!< EADC_T::SCTL9: EXTREN Position         */
#define EADC_SCTL9_EXTREN_Msk        ( 0x1ul << EADC_SCTL9_EXTREN_Pos )                    /*!< EADC_T::SCTL9: EXTREN Mask             */

#define EADC_SCTL9_EXTFEN_Pos        ( 5 )                                                 /*!< EADC_T::SCTL9: EXTFEN Position         */
#define EADC_SCTL9_EXTFEN_Msk        ( 0x1ul << EADC_SCTL9_EXTFEN_Pos )                    /*!< EADC_T::SCTL9: EXTFEN Mask             */

#define EADC_SCTL9_TRGDLYDIV_Pos     ( 6 )                                                 /*!< EADC_T::SCTL9: TRGDLYDIV Position      */
#define EADC_SCTL9_TRGDLYDIV_Msk     ( 0x3ul << EADC_SCTL9_TRGDLYDIV_Pos )                 /*!< EADC_T::SCTL9: TRGDLYDIV Mask          */

#define EADC_SCTL9_TRGDLYCNT_Pos     ( 8 )                                                 /*!< EADC_T::SCTL9: TRGDLYCNT Position      */
#define EADC_SCTL9_TRGDLYCNT_Msk     ( 0xfful << EADC_SCTL9_TRGDLYCNT_Pos )                /*!< EADC_T::SCTL9: TRGDLYCNT Mask          */

#define EADC_SCTL9_TRGSEL_Pos        ( 16 )                                                /*!< EADC_T::SCTL9: TRGSEL Position         */
#define EADC_SCTL9_TRGSEL_Msk        ( 0x1ful << EADC_SCTL9_TRGSEL_Pos )                   /*!< EADC_T::SCTL9: TRGSEL Mask             */

#define EADC_SCTL9_INTPOS_Pos        ( 22 )                                                /*!< EADC_T::SCTL9: INTPOS Position         */
#define EADC_SCTL9_INTPOS_Msk        ( 0x1ul << EADC_SCTL9_INTPOS_Pos )                    /*!< EADC_T::SCTL9: INTPOS Mask             */

#define EADC_SCTL9_EXTSMPT_Pos       ( 24 )                                                /*!< EADC_T::SCTL9: EXTSMPT Position        */
#define EADC_SCTL9_EXTSMPT_Msk       ( 0xfful << EADC_SCTL9_EXTSMPT_Pos )                  /*!< EADC_T::SCTL9: EXTSMPT Mask            */

#define EADC_SCTL10_CHSEL_Pos        ( 0 )                                                 /*!< EADC_T::SCTL10: CHSEL Position         */
#define EADC_SCTL10_CHSEL_Msk        ( 0xful << EADC_SCTL10_CHSEL_Pos )                    /*!< EADC_T::SCTL10: CHSEL Mask             */

#define EADC_SCTL10_EXTREN_Pos       ( 4 )                                                 /*!< EADC_T::SCTL10: EXTREN Position        */
#define EADC_SCTL10_EXTREN_Msk       ( 0x1ul << EADC_SCTL10_EXTREN_Pos )                   /*!< EADC_T::SCTL10: EXTREN Mask            */

#define EADC_SCTL10_EXTFEN_Pos       ( 5 )                                                 /*!< EADC_T::SCTL10: EXTFEN Position        */
#define EADC_SCTL10_EXTFEN_Msk       ( 0x1ul << EADC_SCTL10_EXTFEN_Pos )                   /*!< EADC_T::SCTL10: EXTFEN Mask            */

#define EADC_SCTL10_TRGDLYDIV_Pos    ( 6 )                                                 /*!< EADC_T::SCTL10: TRGDLYDIV Position     */
#define EADC_SCTL10_TRGDLYDIV_Msk    ( 0x3ul << EADC_SCTL10_TRGDLYDIV_Pos )                /*!< EADC_T::SCTL10: TRGDLYDIV Mask         */

#define EADC_SCTL10_TRGDLYCNT_Pos    ( 8 )                                                 /*!< EADC_T::SCTL10: TRGDLYCNT Position     */
#define EADC_SCTL10_TRGDLYCNT_Msk    ( 0xfful << EADC_SCTL10_TRGDLYCNT_Pos )               /*!< EADC_T::SCTL10: TRGDLYCNT Mask         */

#define EADC_SCTL10_TRGSEL_Pos       ( 16 )                                                /*!< EADC_T::SCTL10: TRGSEL Position        */
#define EADC_SCTL10_TRGSEL_Msk       ( 0x1ful << EADC_SCTL10_TRGSEL_Pos )                  /*!< EADC_T::SCTL10: TRGSEL Mask            */

#define EADC_SCTL10_INTPOS_Pos       ( 22 )                                                /*!< EADC_T::SCTL10: INTPOS Position        */
#define EADC_SCTL10_INTPOS_Msk       ( 0x1ul << EADC_SCTL10_INTPOS_Pos )                   /*!< EADC_T::SCTL10: INTPOS Mask            */

#define EADC_SCTL10_EXTSMPT_Pos      ( 24 )                                                /*!< EADC_T::SCTL10: EXTSMPT Position       */
#define EADC_SCTL10_EXTSMPT_Msk      ( 0xfful << EADC_SCTL10_EXTSMPT_Pos )                 /*!< EADC_T::SCTL10: EXTSMPT Mask           */

#define EADC_SCTL11_CHSEL_Pos        ( 0 )                                                 /*!< EADC_T::SCTL11: CHSEL Position         */
#define EADC_SCTL11_CHSEL_Msk        ( 0xful << EADC_SCTL11_CHSEL_Pos )                    /*!< EADC_T::SCTL11: CHSEL Mask             */

#define EADC_SCTL11_EXTREN_Pos       ( 4 )                                                 /*!< EADC_T::SCTL11: EXTREN Position        */
#define EADC_SCTL11_EXTREN_Msk       ( 0x1ul << EADC_SCTL11_EXTREN_Pos )                   /*!< EADC_T::SCTL11: EXTREN Mask            */

#define EADC_SCTL11_EXTFEN_Pos       ( 5 )                                                 /*!< EADC_T::SCTL11: EXTFEN Position        */
#define EADC_SCTL11_EXTFEN_Msk       ( 0x1ul << EADC_SCTL11_EXTFEN_Pos )                   /*!< EADC_T::SCTL11: EXTFEN Mask            */

#define EADC_SCTL11_TRGDLYDIV_Pos    ( 6 )                                                 /*!< EADC_T::SCTL11: TRGDLYDIV Position     */
#define EADC_SCTL11_TRGDLYDIV_Msk    ( 0x3ul << EADC_SCTL11_TRGDLYDIV_Pos )                /*!< EADC_T::SCTL11: TRGDLYDIV Mask         */

#define EADC_SCTL11_TRGDLYCNT_Pos    ( 8 )                                                 /*!< EADC_T::SCTL11: TRGDLYCNT Position     */
#define EADC_SCTL11_TRGDLYCNT_Msk    ( 0xfful << EADC_SCTL11_TRGDLYCNT_Pos )               /*!< EADC_T::SCTL11: TRGDLYCNT Mask         */

#define EADC_SCTL11_TRGSEL_Pos       ( 16 )                                                /*!< EADC_T::SCTL11: TRGSEL Position        */
#define EADC_SCTL11_TRGSEL_Msk       ( 0x1ful << EADC_SCTL11_TRGSEL_Pos )                  /*!< EADC_T::SCTL11: TRGSEL Mask            */

#define EADC_SCTL11_INTPOS_Pos       ( 22 )                                                /*!< EADC_T::SCTL11: INTPOS Position        */
#define EADC_SCTL11_INTPOS_Msk       ( 0x1ul << EADC_SCTL11_INTPOS_Pos )                   /*!< EADC_T::SCTL11: INTPOS Mask            */

#define EADC_SCTL11_EXTSMPT_Pos      ( 24 )                                                /*!< EADC_T::SCTL11: EXTSMPT Position       */
#define EADC_SCTL11_EXTSMPT_Msk      ( 0xfful << EADC_SCTL11_EXTSMPT_Pos )                 /*!< EADC_T::SCTL11: EXTSMPT Mask           */

