FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_SCTL12_CHSEL_Pos        ( 0 )                                                 /*!< EADC_T::SCTL12: CHSEL Position         */
#define EADC_SCTL12_CHSEL_Msk        ( 0xful << EADC_SCTL12_CHSEL_Pos )                    /*!< EADC_T::SCTL12: CHSEL Mask             */

#define EADC_SCTL12_EXTREN_Pos       ( 4 )                                                 /*!< EADC_T::SCTL12: EXTREN Position        */
#define EADC_SCTL12_EXTREN_Msk       ( 0x1ul << EADC_SCTL12_EXTREN_Pos )                   /*!< EADC_T::SCTL12: EXTREN Mask            */

#define EADC_SCTL12_EXTFEN_Pos       ( 5 )                                                 /*!< EADC_T::SCTL12: EXTFEN Position        */
#define EADC_SCTL12_EXTFEN_Msk       ( 0x1ul << EADC_SCTL12_EXTFEN_Pos )                   /*!< EADC_T::SCTL12: EXTFEN Mask            */

#define EADC_SCTL12_TRGDLYDIV_Pos    ( 6 )                                                 /*!< EADC_T::SCTL12: TRGDLYDIV Position     */
#define EADC_SCTL12_TRGDLYDIV_Msk    ( 0x3ul << EADC_SCTL12_TRGDLYDIV_Pos )                /*!< EADC_T::SCTL12: TRGDLYDIV Mask         */

#define EADC_SCTL12_TRGDLYCNT_Pos    ( 8 )                                                 /*!< EADC_T::SCTL12: TRGDLYCNT Position     */
#define EADC_SCTL12_TRGDLYCNT_Msk    ( 0xfful << EADC_SCTL12_TRGDLYCNT_Pos )               /*!< EADC_T::SCTL12: TRGDLYCNT Mask         */

#define EADC_SCTL12_TRGSEL_Pos       ( 16 )                                                /*!< EADC_T::SCTL12: TRGSEL Position        */
#define EADC_SCTL12_TRGSEL_Msk       ( 0x1ful << EADC_SCTL12_TRGSEL_Pos )                  /*!< EADC_T::SCTL12: TRGSEL Mask            */

#define EADC_SCTL12_INTPOS_Pos       ( 22 )                                                /*!< EADC_T::SCTL12: INTPOS Position        */
#define EADC_SCTL12_INTPOS_Msk       ( 0x1ul << EADC_SCTL12_INTPOS_Pos )                   /*!< EADC_T::SCTL12: INTPOS Mask            */

#define EADC_SCTL12_EXTSMPT_Pos      ( 24 )                                                /*!< EADC_T::SCTL12: EXTSMPT Position       */
#define EADC_SCTL12_EXTSMPT_Msk      ( 0xfful << EADC_SCTL12_EXTSMPT_Pos )                 /*!< EADC_T::SCTL12: EXTSMPT Mask           */

#define EADC_SCTL13_CHSEL_Pos        ( 0 )                                                 /*!< EADC_T::SCTL13: CHSEL Position         */
#define EADC_SCTL13_CHSEL_Msk        ( 0xful << EADC_SCTL13_CHSEL_Pos )                    /*!< EADC_T::SCTL13: CHSEL Mask             */

#define EADC_SCTL13_EXTREN_Pos       ( 4 )                                                 /*!< EADC_T::SCTL13: EXTREN Position        */
#define EADC_SCTL13_EXTREN_Msk       ( 0x1ul << EADC_SCTL13_EXTREN_Pos )                   /*!< EADC_T::SCTL13: EXTREN Mask            */

#define EADC_SCTL13_EXTFEN_Pos       ( 5 )                                                 /*!< EADC_T::SCTL13: EXTFEN Position        */
#define EADC_SCTL13_EXTFEN_Msk       ( 0x1ul << EADC_SCTL13_EXTFEN_Pos )                   /*!< EADC_T::SCTL13: EXTFEN Mask            */

#define EADC_SCTL13_TRGDLYDIV_Pos    ( 6 )                                                 /*!< EADC_T::SCTL13: TRGDLYDIV Position     */
#define EADC_SCTL13_TRGDLYDIV_Msk    ( 0x3ul << EADC_SCTL13_TRGDLYDIV_Pos )                /*!< EADC_T::SCTL13: TRGDLYDIV Mask         */

#define EADC_SCTL13_TRGDLYCNT_Pos    ( 8 )                                                 /*!< EADC_T::SCTL13: TRGDLYCNT Position     */
#define EADC_SCTL13_TRGDLYCNT_Msk    ( 0xfful << EADC_SCTL13_TRGDLYCNT_Pos )               /*!< EADC_T::SCTL13: TRGDLYCNT Mask         */

#define EADC_SCTL13_TRGSEL_Pos       ( 16 )                                                /*!< EADC_T::SCTL13: TRGSEL Position        */
#define EADC_SCTL13_TRGSEL_Msk       ( 0x1ful << EADC_SCTL13_TRGSEL_Pos )                  /*!< EADC_T::SCTL13: TRGSEL Mask            */

#define EADC_SCTL13_INTPOS_Pos       ( 22 )                                                /*!< EADC_T::SCTL13: INTPOS Position        */
#define EADC_SCTL13_INTPOS_Msk       ( 0x1ul << EADC_SCTL13_INTPOS_Pos )                   /*!< EADC_T::SCTL13: INTPOS Mask            */

#define EADC_SCTL13_EXTSMPT_Pos      ( 24 )                                                /*!< EADC_T::SCTL13: EXTSMPT Position       */
#define EADC_SCTL13_EXTSMPT_Msk      ( 0xfful << EADC_SCTL13_EXTSMPT_Pos )                 /*!< EADC_T::SCTL13: EXTSMPT Mask           */

#define EADC_SCTL14_CHSEL_Pos        ( 0 )                                                 /*!< EADC_T::SCTL14: CHSEL Position         */
#define EADC_SCTL14_CHSEL_Msk        ( 0xful << EADC_SCTL14_CHSEL_Pos )                    /*!< EADC_T::SCTL14: CHSEL Mask             */

#define EADC_SCTL14_EXTREN_Pos       ( 4 )                                                 /*!< EADC_T::SCTL14: EXTREN Position        */
#define EADC_SCTL14_EXTREN_Msk       ( 0x1ul << EADC_SCTL14_EXTREN_Pos )                   /*!< EADC_T::SCTL14: EXTREN Mask            */

#define EADC_SCTL14_EXTFEN_Pos       ( 5 )                                                 /*!< EADC_T::SCTL14: EXTFEN Position        */
#define EADC_SCTL14_EXTFEN_Msk       ( 0x1ul << EADC_SCTL14_EXTFEN_Pos )                   /*!< EADC_T::SCTL14: EXTFEN Mask            */

#define EADC_SCTL14_TRGDLYDIV_Pos    ( 6 )                                                 /*!< EADC_T::SCTL14: TRGDLYDIV Position     */
#define EADC_SCTL14_TRGDLYDIV_Msk    ( 0x3ul << EADC_SCTL14_TRGDLYDIV_Pos )                /*!< EADC_T::SCTL14: TRGDLYDIV Mask         */

#define EADC_SCTL14_TRGDLYCNT_Pos    ( 8 )                                                 /*!< EADC_T::SCTL14: TRGDLYCNT Position     */
#define EADC_SCTL14_TRGDLYCNT_Msk    ( 0xfful << EADC_SCTL14_TRGDLYCNT_Pos )               /*!< EADC_T::SCTL14: TRGDLYCNT Mask         */

#define EADC_SCTL14_TRGSEL_Pos       ( 16 )                                                /*!< EADC_T::SCTL14: TRGSEL Position        */
#define EADC_SCTL14_TRGSEL_Msk       ( 0x1ful << EADC_SCTL14_TRGSEL_Pos )                  /*!< EADC_T::SCTL14: TRGSEL Mask            */

#define EADC_SCTL14_INTPOS_Pos       ( 22 )                                                /*!< EADC_T::SCTL14: INTPOS Position        */
#define EADC_SCTL14_INTPOS_Msk       ( 0x1ul << EADC_SCTL14_INTPOS_Pos )                   /*!< EADC_T::SCTL14: INTPOS Mask            */

#define EADC_SCTL14_EXTSMPT_Pos      ( 24 )                                                /*!< EADC_T::SCTL14: EXTSMPT Position       */
#define EADC_SCTL14_EXTSMPT_Msk      ( 0xfful << EADC_SCTL14_EXTSMPT_Pos )                 /*!< EADC_T::SCTL14: EXTSMPT Mask           */

