FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_SCTL15_CHSEL_Pos        ( 0 )                                                 /*!< EADC_T::SCTL15: CHSEL Position         */
#define EADC_SCTL15_CHSEL_Msk        ( 0xful << EADC_SCTL15_CHSEL_Pos )                    /*!< EADC_T::SCTL15: CHSEL Mask             */

#define EADC_SCTL15_EXTREN_Pos       ( 4 )                                                 /*!< EADC_T::SCTL15: EXTREN Position        */
#define EADC_SCTL15_EXTREN_Msk       ( 0x1ul << EADC_SCTL15_EXTREN_Pos )                   /*!< EADC_T::SCTL15: EXTREN Mask            */

#define EADC_SCTL15_EXTFEN_Pos       ( 5 )                                                 /*!< EADC_T::SCTL15: EXTFEN Position        */
#define EADC_SCTL15_EXTFEN_Msk       ( 0x1ul << EADC_SCTL15_EXTFEN_Pos )                   /*!< EADC_T::SCTL15: EXTFEN Mask            */

#define EADC_SCTL15_TRGDLYDIV_Pos    ( 6 )                                                 /*!< EADC_T::SCTL15: TRGDLYDIV Position     */
#define EADC_SCTL15_TRGDLYDIV_Msk    ( 0x3ul << EADC_SCTL15_TRGDLYDIV_Pos )                /*!< EADC_T::SCTL15: TRGDLYDIV Mask         */

#define EADC_SCTL15_TRGDLYCNT_Pos    ( 8 )                                                 /*!< EADC_T::SCTL15: TRGDLYCNT Position     */
#define EADC_SCTL15_TRGDLYCNT_Msk    ( 0xfful << EADC_SCTL15_TRGDLYCNT_Pos )               /*!< EADC_T::SCTL15: TRGDLYCNT Mask         */

#define EADC_SCTL15_TRGSEL_Pos       ( 16 )                                                /*!< EADC_T::SCTL15: TRGSEL Position        */
#define EADC_SCTL15_TRGSEL_Msk       ( 0x1ful << EADC_SCTL15_TRGSEL_Pos )                  /*!< EADC_T::SCTL15: TRGSEL Mask            */

#define EADC_SCTL15_INTPOS_Pos       ( 22 )                                                /*!< EADC_T::SCTL15: INTPOS Position        */
#define EADC_SCTL15_INTPOS_Msk       ( 0x1ul << EADC_SCTL15_INTPOS_Pos )                   /*!< EADC_T::SCTL15: INTPOS Mask            */

#define EADC_SCTL15_EXTSMPT_Pos      ( 24 )                                                /*!< EADC_T::SCTL15: EXTSMPT Position       */
#define EADC_SCTL15_EXTSMPT_Msk      ( 0xfful << EADC_SCTL15_EXTSMPT_Pos )                 /*!< EADC_T::SCTL15: EXTSMPT Mask           */

#define EADC_SCTL16_EXTSMPT_Pos      ( 24 )                                                /*!< EADC_T::SCTL16: EXTSMPT Position       */
#define EADC_SCTL16_EXTSMPT_Msk      ( 0xfful << EADC_SCTL16_EXTSMPT_Pos )                 /*!< EADC_T::SCTL16: EXTSMPT Mask           */

#define EADC_SCTL17_EXTSMPT_Pos      ( 24 )                                                /*!< EADC_T::SCTL17: EXTSMPT Position       */
#define EADC_SCTL17_EXTSMPT_Msk      ( 0xfful << EADC_SCTL17_EXTSMPT_Pos )                 /*!< EADC_T::SCTL17: EXTSMPT Mask           */

#define EADC_SCTL18_EXTSMPT_Pos      ( 24 )                                                /*!< EADC_T::SCTL18: EXTSMPT Position       */
#define EADC_SCTL18_EXTSMPT_Msk      ( 0xfful << EADC_SCTL18_EXTSMPT_Pos )                 /*!< EADC_T::SCTL18: EXTSMPT Mask           */

#define EADC_INTSRC0_SPLIE0_Pos      ( 0 )                                                 /*!< EADC_T::INTSRC0: SPLIE0 Position       */
#define EADC_INTSRC0_SPLIE0_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE0_Pos )                  /*!< EADC_T::INTSRC0: SPLIE0 Mask           */

#define EADC_INTSRC0_SPLIE1_Pos      ( 1 )                                                 /*!< EADC_T::INTSRC0: SPLIE1 Position       */
#define EADC_INTSRC0_SPLIE1_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE1_Pos )                  /*!< EADC_T::INTSRC0: SPLIE1 Mask           */

#define EADC_INTSRC0_SPLIE2_Pos      ( 2 )                                                 /*!< EADC_T::INTSRC0: SPLIE2 Position       */
#define EADC_INTSRC0_SPLIE2_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE2_Pos )                  /*!< EADC_T::INTSRC0: SPLIE2 Mask           */

#define EADC_INTSRC0_SPLIE3_Pos      ( 3 )                                                 /*!< EADC_T::INTSRC0: SPLIE3 Position       */
#define EADC_INTSRC0_SPLIE3_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE3_Pos )                  /*!< EADC_T::INTSRC0: SPLIE3 Mask           */

#define EADC_INTSRC0_SPLIE4_Pos      ( 4 )                                                 /*!< EADC_T::INTSRC0: SPLIE4 Position       */
#define EADC_INTSRC0_SPLIE4_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE4_Pos )                  /*!< EADC_T::INTSRC0: SPLIE4 Mask           */

#define EADC_INTSRC0_SPLIE5_Pos      ( 5 )                                                 /*!< EADC_T::INTSRC0: SPLIE5 Position       */
#define EADC_INTSRC0_SPLIE5_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE5_Pos )                  /*!< EADC_T::INTSRC0: SPLIE5 Mask           */

#define EADC_INTSRC0_SPLIE6_Pos      ( 6 )                                                 /*!< EADC_T::INTSRC0: SPLIE6 Position       */
#define EADC_INTSRC0_SPLIE6_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE6_Pos )                  /*!< EADC_T::INTSRC0: SPLIE6 Mask           */

#define EADC_INTSRC0_SPLIE7_Pos      ( 7 )                                                 /*!< EADC_T::INTSRC0: SPLIE7 Position       */
#define EADC_INTSRC0_SPLIE7_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE7_Pos )                  /*!< EADC_T::INTSRC0: SPLIE7 Mask           */

#define EADC_INTSRC0_SPLIE8_Pos      ( 8 )                                                 /*!< EADC_T::INTSRC0: SPLIE8 Position       */
#define EADC_INTSRC0_SPLIE8_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE8_Pos )                  /*!< EADC_T::INTSRC0: SPLIE8 Mask           */

#define EADC_INTSRC0_SPLIE9_Pos      ( 9 )                                                 /*!< EADC_T::INTSRC0: SPLIE9 Position       */
#define EADC_INTSRC0_SPLIE9_Msk      ( 0x1ul << EADC_INTSRC0_SPLIE9_Pos )                  /*!< EADC_T::INTSRC0: SPLIE9 Mask           */

#define EADC_INTSRC0_SPLIE10_Pos     ( 10 )                                                /*!< EADC_T::INTSRC0: SPLIE10 Position      */
#define EADC_INTSRC0_SPLIE10_Msk     ( 0x1ul << EADC_INTSRC0_SPLIE10_Pos )                 /*!< EADC_T::INTSRC0: SPLIE10 Mask          */

#define EADC_INTSRC0_SPLIE11_Pos     ( 11 )                                                /*!< EADC_T::INTSRC0: SPLIE11 Position      */
#define EADC_INTSRC0_SPLIE11_Msk     ( 0x1ul << EADC_INTSRC0_SPLIE11_Pos )                 /*!< EADC_T::INTSRC0: SPLIE11 Mask          */

#define EADC_INTSRC0_SPLIE12_Pos     ( 12 )                                                /*!< EADC_T::INTSRC0: SPLIE12 Position      */
#define EADC_INTSRC0_SPLIE12_Msk     ( 0x1ul << EADC_INTSRC0_SPLIE12_Pos )                 /*!< EADC_T::INTSRC0: SPLIE12 Mask          */

#define EADC_INTSRC0_SPLIE13_Pos     ( 13 )                                                /*!< EADC_T::INTSRC0: SPLIE13 Position      */
#define EADC_INTSRC0_SPLIE13_Msk     ( 0x1ul << EADC_INTSRC0_SPLIE13_Pos )                 /*!< EADC_T::INTSRC0: SPLIE13 Mask          */

#define EADC_INTSRC0_SPLIE14_Pos     ( 14 )                                                /*!< EADC_T::INTSRC0: SPLIE14 Position      */
#define EADC_INTSRC0_SPLIE14_Msk     ( 0x1ul << EADC_INTSRC0_SPLIE14_Pos )                 /*!< EADC_T::INTSRC0: SPLIE14 Mask          */

#define EADC_INTSRC0_SPLIE15_Pos     ( 15 )                                                /*!< EADC_T::INTSRC0: SPLIE15 Position      */
#define EADC_INTSRC0_SPLIE15_Msk     ( 0x1ul << EADC_INTSRC0_SPLIE15_Pos )                 /*!< EADC_T::INTSRC0: SPLIE15 Mask          */

#define EADC_INTSRC0_SPLIE16_Pos     ( 16 )                                                /*!< EADC_T::INTSRC0: SPLIE16 Position      */
#define EADC_INTSRC0_SPLIE16_Msk     ( 0x1ul << EADC_INTSRC0_SPLIE16_Pos )                 /*!< EADC_T::INTSRC0: SPLIE16 Mask          */

#define EADC_INTSRC0_SPLIE17_Pos     ( 17 )                                                /*!< EADC_T::INTSRC0: SPLIE17 Position      */
#define EADC_INTSRC0_SPLIE17_Msk     ( 0x1ul << EADC_INTSRC0_SPLIE17_Pos )                 /*!< EADC_T::INTSRC0: SPLIE17 Mask          */

#define EADC_INTSRC0_SPLIE18_Pos     ( 18 )                                                /*!< EADC_T::INTSRC0: SPLIE18 Position      */
#define EADC_INTSRC0_SPLIE18_Msk     ( 0x1ul << EADC_INTSRC0_SPLIE18_Pos )                 /*!< EADC_T::INTSRC0: SPLIE18 Mask          */

#define EADC_INTSRC1_SPLIE0_Pos      ( 0 )                                                 /*!< EADC_T::INTSRC1: SPLIE0 Position       */
#define EADC_INTSRC1_SPLIE0_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE0_Pos )                  /*!< EADC_T::INTSRC1: SPLIE0 Mask           */

#define EADC_INTSRC1_SPLIE1_Pos      ( 1 )                                                 /*!< EADC_T::INTSRC1: SPLIE1 Position       */
#define EADC_INTSRC1_SPLIE1_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE1_Pos )                  /*!< EADC_T::INTSRC1: SPLIE1 Mask           */

