FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_INTSRC1_SPLIE2_Pos      ( 2 )                                                 /*!< EADC_T::INTSRC1: SPLIE2 Position       */
#define EADC_INTSRC1_SPLIE2_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE2_Pos )                  /*!< EADC_T::INTSRC1: SPLIE2 Mask           */

#define EADC_INTSRC1_SPLIE3_Pos      ( 3 )                                                 /*!< EADC_T::INTSRC1: SPLIE3 Position       */
#define EADC_INTSRC1_SPLIE3_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE3_Pos )                  /*!< EADC_T::INTSRC1: SPLIE3 Mask           */

#define EADC_INTSRC1_SPLIE4_Pos      ( 4 )                                                 /*!< EADC_T::INTSRC1: SPLIE4 Position       */
#define EADC_INTSRC1_SPLIE4_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE4_Pos )                  /*!< EADC_T::INTSRC1: SPLIE4 Mask           */

#define EADC_INTSRC1_SPLIE5_Pos      ( 5 )                                                 /*!< EADC_T::INTSRC1: SPLIE5 Position       */
#define EADC_INTSRC1_SPLIE5_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE5_Pos )                  /*!< EADC_T::INTSRC1: SPLIE5 Mask           */

#define EADC_INTSRC1_SPLIE6_Pos      ( 6 )                                                 /*!< EADC_T::INTSRC1: SPLIE6 Position       */
#define EADC_INTSRC1_SPLIE6_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE6_Pos )                  /*!< EADC_T::INTSRC1: SPLIE6 Mask           */

#define EADC_INTSRC1_SPLIE7_Pos      ( 7 )                                                 /*!< EADC_T::INTSRC1: SPLIE7 Position       */
#define EADC_INTSRC1_SPLIE7_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE7_Pos )                  /*!< EADC_T::INTSRC1: SPLIE7 Mask           */

#define EADC_INTSRC1_SPLIE8_Pos      ( 8 )                                                 /*!< EADC_T::INTSRC1: SPLIE8 Position       */
#define EADC_INTSRC1_SPLIE8_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE8_Pos )                  /*!< EADC_T::INTSRC1: SPLIE8 Mask           */

#define EADC_INTSRC1_SPLIE9_Pos      ( 9 )                                                 /*!< EADC_T::INTSRC1: SPLIE9 Position       */
#define EADC_INTSRC1_SPLIE9_Msk      ( 0x1ul << EADC_INTSRC1_SPLIE9_Pos )                  /*!< EADC_T::INTSRC1: SPLIE9 Mask           */

#define EADC_INTSRC1_SPLIE10_Pos     ( 10 )                                                /*!< EADC_T::INTSRC1: SPLIE10 Position      */
#define EADC_INTSRC1_SPLIE10_Msk     ( 0x1ul << EADC_INTSRC1_SPLIE10_Pos )                 /*!< EADC_T::INTSRC1: SPLIE10 Mask          */

#define EADC_INTSRC1_SPLIE11_Pos     ( 11 )                                                /*!< EADC_T::INTSRC1: SPLIE11 Position      */
#define EADC_INTSRC1_SPLIE11_Msk     ( 0x1ul << EADC_INTSRC1_SPLIE11_Pos )                 /*!< EADC_T::INTSRC1: SPLIE11 Mask          */

#define EADC_INTSRC1_SPLIE12_Pos     ( 12 )                                                /*!< EADC_T::INTSRC1: SPLIE12 Position      */
#define EADC_INTSRC1_SPLIE12_Msk     ( 0x1ul << EADC_INTSRC1_SPLIE12_Pos )                 /*!< EADC_T::INTSRC1: SPLIE12 Mask          */

#define EADC_INTSRC1_SPLIE13_Pos     ( 13 )                                                /*!< EADC_T::INTSRC1: SPLIE13 Position      */
#define EADC_INTSRC1_SPLIE13_Msk     ( 0x1ul << EADC_INTSRC1_SPLIE13_Pos )                 /*!< EADC_T::INTSRC1: SPLIE13 Mask          */

#define EADC_INTSRC1_SPLIE14_Pos     ( 14 )                                                /*!< EADC_T::INTSRC1: SPLIE14 Position      */
#define EADC_INTSRC1_SPLIE14_Msk     ( 0x1ul << EADC_INTSRC1_SPLIE14_Pos )                 /*!< EADC_T::INTSRC1: SPLIE14 Mask          */

#define EADC_INTSRC1_SPLIE15_Pos     ( 15 )                                                /*!< EADC_T::INTSRC1: SPLIE15 Position      */
#define EADC_INTSRC1_SPLIE15_Msk     ( 0x1ul << EADC_INTSRC1_SPLIE15_Pos )                 /*!< EADC_T::INTSRC1: SPLIE15 Mask          */

#define EADC_INTSRC1_SPLIE16_Pos     ( 16 )                                                /*!< EADC_T::INTSRC1: SPLIE16 Position      */
#define EADC_INTSRC1_SPLIE16_Msk     ( 0x1ul << EADC_INTSRC1_SPLIE16_Pos )                 /*!< EADC_T::INTSRC1: SPLIE16 Mask          */

#define EADC_INTSRC1_SPLIE17_Pos     ( 17 )                                                /*!< EADC_T::INTSRC1: SPLIE17 Position      */
#define EADC_INTSRC1_SPLIE17_Msk     ( 0x1ul << EADC_INTSRC1_SPLIE17_Pos )                 /*!< EADC_T::INTSRC1: SPLIE17 Mask          */

#define EADC_INTSRC1_SPLIE18_Pos     ( 18 )                                                /*!< EADC_T::INTSRC1: SPLIE18 Position      */
#define EADC_INTSRC1_SPLIE18_Msk     ( 0x1ul << EADC_INTSRC1_SPLIE18_Pos )                 /*!< EADC_T::INTSRC1: SPLIE18 Mask          */

#define EADC_INTSRC2_SPLIE0_Pos      ( 0 )                                                 /*!< EADC_T::INTSRC2: SPLIE0 Position       */
#define EADC_INTSRC2_SPLIE0_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE0_Pos )                  /*!< EADC_T::INTSRC2: SPLIE0 Mask           */

#define EADC_INTSRC2_SPLIE1_Pos      ( 1 )                                                 /*!< EADC_T::INTSRC2: SPLIE1 Position       */
#define EADC_INTSRC2_SPLIE1_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE1_Pos )                  /*!< EADC_T::INTSRC2: SPLIE1 Mask           */

#define EADC_INTSRC2_SPLIE2_Pos      ( 2 )                                                 /*!< EADC_T::INTSRC2: SPLIE2 Position       */
#define EADC_INTSRC2_SPLIE2_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE2_Pos )                  /*!< EADC_T::INTSRC2: SPLIE2 Mask           */

#define EADC_INTSRC2_SPLIE3_Pos      ( 3 )                                                 /*!< EADC_T::INTSRC2: SPLIE3 Position       */
#define EADC_INTSRC2_SPLIE3_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE3_Pos )                  /*!< EADC_T::INTSRC2: SPLIE3 Mask           */

#define EADC_INTSRC2_SPLIE4_Pos      ( 4 )                                                 /*!< EADC_T::INTSRC2: SPLIE4 Position       */
#define EADC_INTSRC2_SPLIE4_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE4_Pos )                  /*!< EADC_T::INTSRC2: SPLIE4 Mask           */

#define EADC_INTSRC2_SPLIE5_Pos      ( 5 )                                                 /*!< EADC_T::INTSRC2: SPLIE5 Position       */
#define EADC_INTSRC2_SPLIE5_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE5_Pos )                  /*!< EADC_T::INTSRC2: SPLIE5 Mask           */

