FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_INTSRC2_SPLIE6_Pos      ( 6 )                                                 /*!< EADC_T::INTSRC2: SPLIE6 Position       */
#define EADC_INTSRC2_SPLIE6_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE6_Pos )                  /*!< EADC_T::INTSRC2: SPLIE6 Mask           */

#define EADC_INTSRC2_SPLIE7_Pos      ( 7 )                                                 /*!< EADC_T::INTSRC2: SPLIE7 Position       */
#define EADC_INTSRC2_SPLIE7_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE7_Pos )                  /*!< EADC_T::INTSRC2: SPLIE7 Mask           */

#define EADC_INTSRC2_SPLIE8_Pos      ( 8 )                                                 /*!< EADC_T::INTSRC2: SPLIE8 Position       */
#define EADC_INTSRC2_SPLIE8_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE8_Pos )                  /*!< EADC_T::INTSRC2: SPLIE8 Mask           */

#define EADC_INTSRC2_SPLIE9_Pos      ( 9 )                                                 /*!< EADC_T::INTSRC2: SPLIE9 Position       */
#define EADC_INTSRC2_SPLIE9_Msk      ( 0x1ul << EADC_INTSRC2_SPLIE9_Pos )                  /*!< EADC_T::INTSRC2: SPLIE9 Mask           */

#define EADC_INTSRC2_SPLIE10_Pos     ( 10 )                                                /*!< EADC_T::INTSRC2: SPLIE10 Position      */
#define EADC_INTSRC2_SPLIE10_Msk     ( 0x1ul << EADC_INTSRC2_SPLIE10_Pos )                 /*!< EADC_T::INTSRC2: SPLIE10 Mask          */

#define EADC_INTSRC2_SPLIE11_Pos     ( 11 )                                                /*!< EADC_T::INTSRC2: SPLIE11 Position      */
#define EADC_INTSRC2_SPLIE11_Msk     ( 0x1ul << EADC_INTSRC2_SPLIE11_Pos )                 /*!< EADC_T::INTSRC2: SPLIE11 Mask          */

#define EADC_INTSRC2_SPLIE12_Pos     ( 12 )                                                /*!< EADC_T::INTSRC2: SPLIE12 Position      */
#define EADC_INTSRC2_SPLIE12_Msk     ( 0x1ul << EADC_INTSRC2_SPLIE12_Pos )                 /*!< EADC_T::INTSRC2: SPLIE12 Mask          */

#define EADC_INTSRC2_SPLIE13_Pos     ( 13 )                                                /*!< EADC_T::INTSRC2: SPLIE13 Position      */
#define EADC_INTSRC2_SPLIE13_Msk     ( 0x1ul << EADC_INTSRC2_SPLIE13_Pos )                 /*!< EADC_T::INTSRC2: SPLIE13 Mask          */

#define EADC_INTSRC2_SPLIE14_Pos     ( 14 )                                                /*!< EADC_T::INTSRC2: SPLIE14 Position      */
#define EADC_INTSRC2_SPLIE14_Msk     ( 0x1ul << EADC_INTSRC2_SPLIE14_Pos )                 /*!< EADC_T::INTSRC2: SPLIE14 Mask          */

#define EADC_INTSRC2_SPLIE15_Pos     ( 15 )                                                /*!< EADC_T::INTSRC2: SPLIE15 Position      */
#define EADC_INTSRC2_SPLIE15_Msk     ( 0x1ul << EADC_INTSRC2_SPLIE15_Pos )                 /*!< EADC_T::INTSRC2: SPLIE15 Mask          */

#define EADC_INTSRC2_SPLIE16_Pos     ( 16 )                                                /*!< EADC_T::INTSRC2: SPLIE16 Position      */
#define EADC_INTSRC2_SPLIE16_Msk     ( 0x1ul << EADC_INTSRC2_SPLIE16_Pos )                 /*!< EADC_T::INTSRC2: SPLIE16 Mask          */

#define EADC_INTSRC2_SPLIE17_Pos     ( 17 )                                                /*!< EADC_T::INTSRC2: SPLIE17 Position      */
#define EADC_INTSRC2_SPLIE17_Msk     ( 0x1ul << EADC_INTSRC2_SPLIE17_Pos )                 /*!< EADC_T::INTSRC2: SPLIE17 Mask          */

#define EADC_INTSRC2_SPLIE18_Pos     ( 18 )                                                /*!< EADC_T::INTSRC2: SPLIE18 Position      */
#define EADC_INTSRC2_SPLIE18_Msk     ( 0x1ul << EADC_INTSRC2_SPLIE18_Pos )                 /*!< EADC_T::INTSRC2: SPLIE18 Mask          */

#define EADC_INTSRC3_SPLIE0_Pos      ( 0 )                                                 /*!< EADC_T::INTSRC3: SPLIE0 Position       */
#define EADC_INTSRC3_SPLIE0_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE0_Pos )                  /*!< EADC_T::INTSRC3: SPLIE0 Mask           */

#define EADC_INTSRC3_SPLIE1_Pos      ( 1 )                                                 /*!< EADC_T::INTSRC3: SPLIE1 Position       */
#define EADC_INTSRC3_SPLIE1_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE1_Pos )                  /*!< EADC_T::INTSRC3: SPLIE1 Mask           */

#define EADC_INTSRC3_SPLIE2_Pos      ( 2 )                                                 /*!< EADC_T::INTSRC3: SPLIE2 Position       */
#define EADC_INTSRC3_SPLIE2_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE2_Pos )                  /*!< EADC_T::INTSRC3: SPLIE2 Mask           */

#define EADC_INTSRC3_SPLIE3_Pos      ( 3 )                                                 /*!< EADC_T::INTSRC3: SPLIE3 Position       */
#define EADC_INTSRC3_SPLIE3_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE3_Pos )                  /*!< EADC_T::INTSRC3: SPLIE3 Mask           */

#define EADC_INTSRC3_SPLIE4_Pos      ( 4 )                                                 /*!< EADC_T::INTSRC3: SPLIE4 Position       */
#define EADC_INTSRC3_SPLIE4_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE4_Pos )                  /*!< EADC_T::INTSRC3: SPLIE4 Mask           */

#define EADC_INTSRC3_SPLIE5_Pos      ( 5 )                                                 /*!< EADC_T::INTSRC3: SPLIE5 Position       */
#define EADC_INTSRC3_SPLIE5_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE5_Pos )                  /*!< EADC_T::INTSRC3: SPLIE5 Mask           */

#define EADC_INTSRC3_SPLIE6_Pos      ( 6 )                                                 /*!< EADC_T::INTSRC3: SPLIE6 Position       */
#define EADC_INTSRC3_SPLIE6_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE6_Pos )                  /*!< EADC_T::INTSRC3: SPLIE6 Mask           */

#define EADC_INTSRC3_SPLIE7_Pos      ( 7 )                                                 /*!< EADC_T::INTSRC3: SPLIE7 Position       */
#define EADC_INTSRC3_SPLIE7_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE7_Pos )                  /*!< EADC_T::INTSRC3: SPLIE7 Mask           */

#define EADC_INTSRC3_SPLIE8_Pos      ( 8 )                                                 /*!< EADC_T::INTSRC3: SPLIE8 Position       */
#define EADC_INTSRC3_SPLIE8_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE8_Pos )                  /*!< EADC_T::INTSRC3: SPLIE8 Mask           */

#define EADC_INTSRC3_SPLIE9_Pos      ( 9 )                                                 /*!< EADC_T::INTSRC3: SPLIE9 Position       */
#define EADC_INTSRC3_SPLIE9_Msk      ( 0x1ul << EADC_INTSRC3_SPLIE9_Pos )                  /*!< EADC_T::INTSRC3: SPLIE9 Mask           */

#define EADC_INTSRC3_SPLIE10_Pos     ( 10 )                                                /*!< EADC_T::INTSRC3: SPLIE10 Position      */
#define EADC_INTSRC3_SPLIE10_Msk     ( 0x1ul << EADC_INTSRC3_SPLIE10_Pos )                 /*!< EADC_T::INTSRC3: SPLIE10 Mask          */

#define EADC_INTSRC3_SPLIE11_Pos     ( 11 )                                                /*!< EADC_T::INTSRC3: SPLIE11 Position      */
#define EADC_INTSRC3_SPLIE11_Msk     ( 0x1ul << EADC_INTSRC3_SPLIE11_Pos )                 /*!< EADC_T::INTSRC3: SPLIE11 Mask          */

#define EADC_INTSRC3_SPLIE12_Pos     ( 12 )                                                /*!< EADC_T::INTSRC3: SPLIE12 Position      */
#define EADC_INTSRC3_SPLIE12_Msk     ( 0x1ul << EADC_INTSRC3_SPLIE12_Pos )                 /*!< EADC_T::INTSRC3: SPLIE12 Mask          */

#define EADC_INTSRC3_SPLIE13_Pos     ( 13 )                                                /*!< EADC_T::INTSRC3: SPLIE13 Position      */
#define EADC_INTSRC3_SPLIE13_Msk     ( 0x1ul << EADC_INTSRC3_SPLIE13_Pos )                 /*!< EADC_T::INTSRC3: SPLIE13 Mask          */

#define EADC_INTSRC3_SPLIE14_Pos     ( 14 )                                                /*!< EADC_T::INTSRC3: SPLIE14 Position      */
#define EADC_INTSRC3_SPLIE14_Msk     ( 0x1ul << EADC_INTSRC3_SPLIE14_Pos )                 /*!< EADC_T::INTSRC3: SPLIE14 Mask          */

#define EADC_INTSRC3_SPLIE15_Pos     ( 15 )                                                /*!< EADC_T::INTSRC3: SPLIE15 Position      */
#define EADC_INTSRC3_SPLIE15_Msk     ( 0x1ul << EADC_INTSRC3_SPLIE15_Pos )                 /*!< EADC_T::INTSRC3: SPLIE15 Mask          */

#define EADC_INTSRC3_SPLIE16_Pos     ( 16 )                                                /*!< EADC_T::INTSRC3: SPLIE16 Position      */
#define EADC_INTSRC3_SPLIE16_Msk     ( 0x1ul << EADC_INTSRC3_SPLIE16_Pos )                 /*!< EADC_T::INTSRC3: SPLIE16 Mask          */

#define EADC_INTSRC3_SPLIE17_Pos     ( 17 )                                                /*!< EADC_T::INTSRC3: SPLIE17 Position      */
#define EADC_INTSRC3_SPLIE17_Msk     ( 0x1ul << EADC_INTSRC3_SPLIE17_Pos )                 /*!< EADC_T::INTSRC3: SPLIE17 Mask          */

#define EADC_INTSRC3_SPLIE18_Pos     ( 18 )                                                /*!< EADC_T::INTSRC3: SPLIE18 Position      */
#define EADC_INTSRC3_SPLIE18_Msk     ( 0x1ul << EADC_INTSRC3_SPLIE18_Pos )                 /*!< EADC_T::INTSRC3: SPLIE18 Mask          */

#define EADC_CMP_ADCMPEN_Pos         ( 0 )                                                 /*!< EADC_T::CMP: ADCMPEN Position          */
#define EADC_CMP_ADCMPEN_Msk         ( 0x1ul << EADC_CMP_ADCMPEN_Pos )                     /*!< EADC_T::CMP: ADCMPEN Mask              */

#define EADC_CMP_ADCMPIE_Pos         ( 1 )                                                 /*!< EADC_T::CMP: ADCMPIE Position          */
#define EADC_CMP_ADCMPIE_Msk         ( 0x1ul << EADC_CMP_ADCMPIE_Pos )                     /*!< EADC_T::CMP: ADCMPIE Mask              */

#define EADC_CMP_CMPCOND_Pos         ( 2 )                                                 /*!< EADC_T::CMP: CMPCOND Position          */
#define EADC_CMP_CMPCOND_Msk         ( 0x1ul << EADC_CMP_CMPCOND_Pos )                     /*!< EADC_T::CMP: CMPCOND Mask              */

#define EADC_CMP_CMPSPL_Pos          ( 3 )                                                 /*!< EADC_T::CMP: CMPSPL Position           */
#define EADC_CMP_CMPSPL_Msk          ( 0x1ful << EADC_CMP_CMPSPL_Pos )                     /*!< EADC_T::CMP: CMPSPL Mask               */

#define EADC_CMP_CMPMCNT_Pos         ( 8 )                                                 /*!< EADC_T::CMP: CMPMCNT Position          */
#define EADC_CMP_CMPMCNT_Msk         ( 0xful << EADC_CMP_CMPMCNT_Pos )                     /*!< EADC_T::CMP: CMPMCNT Mask              */

#define EADC_CMP_CMPWEN_Pos          ( 15 )                                                /*!< EADC_T::CMP: CMPWEN Position           */
#define EADC_CMP_CMPWEN_Msk          ( 0x1ul << EADC_CMP_CMPWEN_Pos )                      /*!< EADC_T::CMP: CMPWEN Mask               */

