FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_CMP_CMPDAT_Pos          ( 16 )                                                /*!< EADC_T::CMP: CMPDAT Position           */
#define EADC_CMP_CMPDAT_Msk          ( 0xffful << EADC_CMP_CMPDAT_Pos )                    /*!< EADC_T::CMP: CMPDAT Mask               */

#define EADC_CMP0_ADCMPEN_Pos        ( 0 )                                                 /*!< EADC_T::CMP0: ADCMPEN Position         */
#define EADC_CMP0_ADCMPEN_Msk        ( 0x1ul << EADC_CMP0_ADCMPEN_Pos )                    /*!< EADC_T::CMP0: ADCMPEN Mask             */

#define EADC_CMP0_ADCMPIE_Pos        ( 1 )                                                 /*!< EADC_T::CMP0: ADCMPIE Position         */
#define EADC_CMP0_ADCMPIE_Msk        ( 0x1ul << EADC_CMP0_ADCMPIE_Pos )                    /*!< EADC_T::CMP0: ADCMPIE Mask             */

#define EADC_CMP0_CMPCOND_Pos        ( 2 )                                                 /*!< EADC_T::CMP0: CMPCOND Position         */
#define EADC_CMP0_CMPCOND_Msk        ( 0x1ul << EADC_CMP0_CMPCOND_Pos )                    /*!< EADC_T::CMP0: CMPCOND Mask             */

#define EADC_CMP0_CMPSPL_Pos         ( 3 )                                                 /*!< EADC_T::CMP0: CMPSPL Position          */
#define EADC_CMP0_CMPSPL_Msk         ( 0x1ful << EADC_CMP0_CMPSPL_Pos )                    /*!< EADC_T::CMP0: CMPSPL Mask              */

#define EADC_CMP0_CMPMCNT_Pos        ( 8 )                                                 /*!< EADC_T::CMP0: CMPMCNT Position         */
#define EADC_CMP0_CMPMCNT_Msk        ( 0xful << EADC_CMP0_CMPMCNT_Pos )                    /*!< EADC_T::CMP0: CMPMCNT Mask             */

#define EADC_CMP0_CMPWEN_Pos         ( 15 )                                                /*!< EADC_T::CMP0: CMPWEN Position          */
#define EADC_CMP0_CMPWEN_Msk         ( 0x1ul << EADC_CMP0_CMPWEN_Pos )                     /*!< EADC_T::CMP0: CMPWEN Mask              */

#define EADC_CMP0_CMPDAT_Pos         ( 16 )                                                /*!< EADC_T::CMP0: CMPDAT Position          */
#define EADC_CMP0_CMPDAT_Msk         ( 0xffful << EADC_CMP0_CMPDAT_Pos )                   /*!< EADC_T::CMP0: CMPDAT Mask              */

#define EADC_CMP1_ADCMPEN_Pos        ( 0 )                                                 /*!< EADC_T::CMP1: ADCMPEN Position         */
#define EADC_CMP1_ADCMPEN_Msk        ( 0x1ul << EADC_CMP1_ADCMPEN_Pos )                    /*!< EADC_T::CMP1: ADCMPEN Mask             */

#define EADC_CMP1_ADCMPIE_Pos        ( 1 )                                                 /*!< EADC_T::CMP1: ADCMPIE Position         */
#define EADC_CMP1_ADCMPIE_Msk        ( 0x1ul << EADC_CMP1_ADCMPIE_Pos )                    /*!< EADC_T::CMP1: ADCMPIE Mask             */

#define EADC_CMP1_CMPCOND_Pos        ( 2 )                                                 /*!< EADC_T::CMP1: CMPCOND Position         */
#define EADC_CMP1_CMPCOND_Msk        ( 0x1ul << EADC_CMP1_CMPCOND_Pos )                    /*!< EADC_T::CMP1: CMPCOND Mask             */

#define EADC_CMP1_CMPSPL_Pos         ( 3 )                                                 /*!< EADC_T::CMP1: CMPSPL Position          */
#define EADC_CMP1_CMPSPL_Msk         ( 0x1ful << EADC_CMP1_CMPSPL_Pos )                    /*!< EADC_T::CMP1: CMPSPL Mask              */

#define EADC_CMP1_CMPMCNT_Pos        ( 8 )                                                 /*!< EADC_T::CMP1: CMPMCNT Position         */
#define EADC_CMP1_CMPMCNT_Msk        ( 0xful << EADC_CMP1_CMPMCNT_Pos )                    /*!< EADC_T::CMP1: CMPMCNT Mask             */

#define EADC_CMP1_CMPWEN_Pos         ( 15 )                                                /*!< EADC_T::CMP1: CMPWEN Position          */
#define EADC_CMP1_CMPWEN_Msk         ( 0x1ul << EADC_CMP1_CMPWEN_Pos )                     /*!< EADC_T::CMP1: CMPWEN Mask              */

#define EADC_CMP1_CMPDAT_Pos         ( 16 )                                                /*!< EADC_T::CMP1: CMPDAT Position          */
#define EADC_CMP1_CMPDAT_Msk         ( 0xffful << EADC_CMP1_CMPDAT_Pos )                   /*!< EADC_T::CMP1: CMPDAT Mask              */

#define EADC_CMP2_ADCMPEN_Pos        ( 0 )                                                 /*!< EADC_T::CMP2: ADCMPEN Position         */
#define EADC_CMP2_ADCMPEN_Msk        ( 0x1ul << EADC_CMP2_ADCMPEN_Pos )                    /*!< EADC_T::CMP2: ADCMPEN Mask             */

#define EADC_CMP2_ADCMPIE_Pos        ( 1 )                                                 /*!< EADC_T::CMP2: ADCMPIE Position         */
#define EADC_CMP2_ADCMPIE_Msk        ( 0x1ul << EADC_CMP2_ADCMPIE_Pos )                    /*!< EADC_T::CMP2: ADCMPIE Mask             */

#define EADC_CMP2_CMPCOND_Pos        ( 2 )                                                 /*!< EADC_T::CMP2: CMPCOND Position         */
#define EADC_CMP2_CMPCOND_Msk        ( 0x1ul << EADC_CMP2_CMPCOND_Pos )                    /*!< EADC_T::CMP2: CMPCOND Mask             */

#define EADC_CMP2_CMPSPL_Pos         ( 3 )                                                 /*!< EADC_T::CMP2: CMPSPL Position          */
#define EADC_CMP2_CMPSPL_Msk         ( 0x1ful << EADC_CMP2_CMPSPL_Pos )                    /*!< EADC_T::CMP2: CMPSPL Mask              */

#define EADC_CMP2_CMPMCNT_Pos        ( 8 )                                                 /*!< EADC_T::CMP2: CMPMCNT Position         */
#define EADC_CMP2_CMPMCNT_Msk        ( 0xful << EADC_CMP2_CMPMCNT_Pos )                    /*!< EADC_T::CMP2: CMPMCNT Mask             */

#define EADC_CMP2_CMPWEN_Pos         ( 15 )                                                /*!< EADC_T::CMP2: CMPWEN Position          */
#define EADC_CMP2_CMPWEN_Msk         ( 0x1ul << EADC_CMP2_CMPWEN_Pos )                     /*!< EADC_T::CMP2: CMPWEN Mask              */

#define EADC_CMP2_CMPDAT_Pos         ( 16 )                                                /*!< EADC_T::CMP2: CMPDAT Position          */
#define EADC_CMP2_CMPDAT_Msk         ( 0xffful << EADC_CMP2_CMPDAT_Pos )                   /*!< EADC_T::CMP2: CMPDAT Mask              */

#define EADC_CMP3_ADCMPEN_Pos        ( 0 )                                                 /*!< EADC_T::CMP3: ADCMPEN Position         */
#define EADC_CMP3_ADCMPEN_Msk        ( 0x1ul << EADC_CMP3_ADCMPEN_Pos )                    /*!< EADC_T::CMP3: ADCMPEN Mask             */

#define EADC_CMP3_ADCMPIE_Pos        ( 1 )                                                 /*!< EADC_T::CMP3: ADCMPIE Position         */
#define EADC_CMP3_ADCMPIE_Msk        ( 0x1ul << EADC_CMP3_ADCMPIE_Pos )                    /*!< EADC_T::CMP3: ADCMPIE Mask             */

#define EADC_CMP3_CMPCOND_Pos        ( 2 )                                                 /*!< EADC_T::CMP3: CMPCOND Position         */
#define EADC_CMP3_CMPCOND_Msk        ( 0x1ul << EADC_CMP3_CMPCOND_Pos )                    /*!< EADC_T::CMP3: CMPCOND Mask             */

#define EADC_CMP3_CMPSPL_Pos         ( 3 )                                                 /*!< EADC_T::CMP3: CMPSPL Position          */
#define EADC_CMP3_CMPSPL_Msk         ( 0x1ful << EADC_CMP3_CMPSPL_Pos )                    /*!< EADC_T::CMP3: CMPSPL Mask              */

#define EADC_CMP3_CMPMCNT_Pos        ( 8 )                                                 /*!< EADC_T::CMP3: CMPMCNT Position         */
#define EADC_CMP3_CMPMCNT_Msk        ( 0xful << EADC_CMP3_CMPMCNT_Pos )                    /*!< EADC_T::CMP3: CMPMCNT Mask             */

#define EADC_CMP3_CMPWEN_Pos         ( 15 )                                                /*!< EADC_T::CMP3: CMPWEN Position          */
#define EADC_CMP3_CMPWEN_Msk         ( 0x1ul << EADC_CMP3_CMPWEN_Pos )                     /*!< EADC_T::CMP3: CMPWEN Mask              */

#define EADC_CMP3_CMPDAT_Pos         ( 16 )                                                /*!< EADC_T::CMP3: CMPDAT Position          */
#define EADC_CMP3_CMPDAT_Msk         ( 0xffful << EADC_CMP3_CMPDAT_Pos )                   /*!< EADC_T::CMP3: CMPDAT Mask              */

#define EADC_STATUS0_VALID_Pos       ( 0 )                                                 /*!< EADC_T::STATUS0: VALID Position        */
#define EADC_STATUS0_VALID_Msk       ( 0xfffful << EADC_STATUS0_VALID_Pos )                /*!< EADC_T::STATUS0: VALID Mask            */

#define EADC_STATUS0_OV_Pos          ( 16 )                                                /*!< EADC_T::STATUS0: OV Position           */
#define EADC_STATUS0_OV_Msk          ( 0xfffful << EADC_STATUS0_OV_Pos )                   /*!< EADC_T::STATUS0: OV Mask               */

#define EADC_STATUS1_VALID_Pos       ( 0 )                                                 /*!< EADC_T::STATUS1: VALID Position        */
#define EADC_STATUS1_VALID_Msk       ( 0x7ul << EADC_STATUS1_VALID_Pos )                   /*!< EADC_T::STATUS1: VALID Mask            */

#define EADC_STATUS1_OV_Pos          ( 16 )                                                /*!< EADC_T::STATUS1: OV Position           */
#define EADC_STATUS1_OV_Msk          ( 0x7ul << EADC_STATUS1_OV_Pos )                      /*!< EADC_T::STATUS1: OV Mask               */

#define EADC_STATUS2_ADIF0_Pos       ( 0 )                                                 /*!< EADC_T::STATUS2: ADIF0 Position        */
#define EADC_STATUS2_ADIF0_Msk       ( 0x1ul << EADC_STATUS2_ADIF0_Pos )                   /*!< EADC_T::STATUS2: ADIF0 Mask            */

#define EADC_STATUS2_ADIF1_Pos       ( 1 )                                                 /*!< EADC_T::STATUS2: ADIF1 Position        */
#define EADC_STATUS2_ADIF1_Msk       ( 0x1ul << EADC_STATUS2_ADIF1_Pos )                   /*!< EADC_T::STATUS2: ADIF1 Mask            */

#define EADC_STATUS2_ADIF2_Pos       ( 2 )                                                 /*!< EADC_T::STATUS2: ADIF2 Position        */
#define EADC_STATUS2_ADIF2_Msk       ( 0x1ul << EADC_STATUS2_ADIF2_Pos )                   /*!< EADC_T::STATUS2: ADIF2 Mask            */

#define EADC_STATUS2_ADIF3_Pos       ( 3 )                                                 /*!< EADC_T::STATUS2: ADIF3 Position        */
#define EADC_STATUS2_ADIF3_Msk       ( 0x1ul << EADC_STATUS2_ADIF3_Pos )                   /*!< EADC_T::STATUS2: ADIF3 Mask            */

