FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_STATUS2_ADCMPF0_Pos     ( 4 )                                                 /*!< EADC_T::STATUS2: ADCMPF0 Position      */
#define EADC_STATUS2_ADCMPF0_Msk     ( 0x1ul << EADC_STATUS2_ADCMPF0_Pos )                 /*!< EADC_T::STATUS2: ADCMPF0 Mask          */

#define EADC_STATUS2_ADCMPF1_Pos     ( 5 )                                                 /*!< EADC_T::STATUS2: ADCMPF1 Position      */
#define EADC_STATUS2_ADCMPF1_Msk     ( 0x1ul << EADC_STATUS2_ADCMPF1_Pos )                 /*!< EADC_T::STATUS2: ADCMPF1 Mask          */

#define EADC_STATUS2_ADCMPF2_Pos     ( 6 )                                                 /*!< EADC_T::STATUS2: ADCMPF2 Position      */
#define EADC_STATUS2_ADCMPF2_Msk     ( 0x1ul << EADC_STATUS2_ADCMPF2_Pos )                 /*!< EADC_T::STATUS2: ADCMPF2 Mask          */

#define EADC_STATUS2_ADCMPF3_Pos     ( 7 )                                                 /*!< EADC_T::STATUS2: ADCMPF3 Position      */
#define EADC_STATUS2_ADCMPF3_Msk     ( 0x1ul << EADC_STATUS2_ADCMPF3_Pos )                 /*!< EADC_T::STATUS2: ADCMPF3 Mask          */

#define EADC_STATUS2_ADOVIF0_Pos     ( 8 )                                                 /*!< EADC_T::STATUS2: ADOVIF0 Position      */
#define EADC_STATUS2_ADOVIF0_Msk     ( 0x1ul << EADC_STATUS2_ADOVIF0_Pos )                 /*!< EADC_T::STATUS2: ADOVIF0 Mask          */

#define EADC_STATUS2_ADOVIF1_Pos     ( 9 )                                                 /*!< EADC_T::STATUS2: ADOVIF1 Position      */
#define EADC_STATUS2_ADOVIF1_Msk     ( 0x1ul << EADC_STATUS2_ADOVIF1_Pos )                 /*!< EADC_T::STATUS2: ADOVIF1 Mask          */

#define EADC_STATUS2_ADOVIF2_Pos     ( 10 )                                                /*!< EADC_T::STATUS2: ADOVIF2 Position      */
#define EADC_STATUS2_ADOVIF2_Msk     ( 0x1ul << EADC_STATUS2_ADOVIF2_Pos )                 /*!< EADC_T::STATUS2: ADOVIF2 Mask          */

#define EADC_STATUS2_ADOVIF3_Pos     ( 11 )                                                /*!< EADC_T::STATUS2: ADOVIF3 Position      */
#define EADC_STATUS2_ADOVIF3_Msk     ( 0x1ul << EADC_STATUS2_ADOVIF3_Pos )                 /*!< EADC_T::STATUS2: ADOVIF3 Mask          */

#define EADC_STATUS2_ADCMPO0_Pos     ( 12 )                                                /*!< EADC_T::STATUS2: ADCMPO0 Position      */
#define EADC_STATUS2_ADCMPO0_Msk     ( 0x1ul << EADC_STATUS2_ADCMPO0_Pos )                 /*!< EADC_T::STATUS2: ADCMPO0 Mask          */

#define EADC_STATUS2_ADCMPO1_Pos     ( 13 )                                                /*!< EADC_T::STATUS2: ADCMPO1 Position      */
#define EADC_STATUS2_ADCMPO1_Msk     ( 0x1ul << EADC_STATUS2_ADCMPO1_Pos )                 /*!< EADC_T::STATUS2: ADCMPO1 Mask          */

#define EADC_STATUS2_ADCMPO2_Pos     ( 14 )                                                /*!< EADC_T::STATUS2: ADCMPO2 Position      */
#define EADC_STATUS2_ADCMPO2_Msk     ( 0x1ul << EADC_STATUS2_ADCMPO2_Pos )                 /*!< EADC_T::STATUS2: ADCMPO2 Mask          */

#define EADC_STATUS2_ADCMPO3_Pos     ( 15 )                                                /*!< EADC_T::STATUS2: ADCMPO3 Position      */
#define EADC_STATUS2_ADCMPO3_Msk     ( 0x1ul << EADC_STATUS2_ADCMPO3_Pos )                 /*!< EADC_T::STATUS2: ADCMPO3 Mask          */

#define EADC_STATUS2_CHANNEL_Pos     ( 16 )                                                /*!< EADC_T::STATUS2: CHANNEL Position      */
#define EADC_STATUS2_CHANNEL_Msk     ( 0x1ful << EADC_STATUS2_CHANNEL_Pos )                /*!< EADC_T::STATUS2: CHANNEL Mask          */

#define EADC_STATUS2_BUSY_Pos        ( 23 )                                                /*!< EADC_T::STATUS2: BUSY Position         */
#define EADC_STATUS2_BUSY_Msk        ( 0x1ul << EADC_STATUS2_BUSY_Pos )                    /*!< EADC_T::STATUS2: BUSY Mask             */

#define EADC_STATUS2_ADOVIF_Pos      ( 24 )                                                /*!< EADC_T::STATUS2: ADOVIF Position       */
#define EADC_STATUS2_ADOVIF_Msk      ( 0x1ul << EADC_STATUS2_ADOVIF_Pos )                  /*!< EADC_T::STATUS2: ADOVIF Mask           */

#define EADC_STATUS2_STOVF_Pos       ( 25 )                                                /*!< EADC_T::STATUS2: STOVF Position        */
#define EADC_STATUS2_STOVF_Msk       ( 0x1ul << EADC_STATUS2_STOVF_Pos )                   /*!< EADC_T::STATUS2: STOVF Mask            */

#define EADC_STATUS2_AVALID_Pos      ( 26 )                                                /*!< EADC_T::STATUS2: AVALID Position       */
#define EADC_STATUS2_AVALID_Msk      ( 0x1ul << EADC_STATUS2_AVALID_Pos )                  /*!< EADC_T::STATUS2: AVALID Mask           */

#define EADC_STATUS2_AOV_Pos         ( 27 )                                                /*!< EADC_T::STATUS2: AOV Position          */
#define EADC_STATUS2_AOV_Msk         ( 0x1ul << EADC_STATUS2_AOV_Pos )                     /*!< EADC_T::STATUS2: AOV Mask              */

#define EADC_STATUS3_CURSPL_Pos      ( 0 )                                                 /*!< EADC_T::STATUS3: CURSPL Position       */
#define EADC_STATUS3_CURSPL_Msk      ( 0x1ful << EADC_STATUS3_CURSPL_Pos )                 /*!< EADC_T::STATUS3: CURSPL Mask           */

#define EADC_DDAT0_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DDAT0: RESULT Position         */
#define EADC_DDAT0_RESULT_Msk        ( 0xfffful << EADC_DDAT0_RESULT_Pos )                 /*!< EADC_T::DDAT0: RESULT Mask             */

#define EADC_DDAT0_OV_Pos            ( 16 )                                                /*!< EADC_T::DDAT0: OV Position             */
#define EADC_DDAT0_OV_Msk            ( 0x1ul << EADC_DDAT0_OV_Pos )                        /*!< EADC_T::DDAT0: OV Mask                 */

#define EADC_DDAT0_VALID_Pos         ( 17 )                                                /*!< EADC_T::DDAT0: VALID Position          */
#define EADC_DDAT0_VALID_Msk         ( 0x1ul << EADC_DDAT0_VALID_Pos )                     /*!< EADC_T::DDAT0: VALID Mask              */

#define EADC_DDAT1_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DDAT1: RESULT Position         */
#define EADC_DDAT1_RESULT_Msk        ( 0xfffful << EADC_DDAT1_RESULT_Pos )                 /*!< EADC_T::DDAT1: RESULT Mask             */

#define EADC_DDAT1_OV_Pos            ( 16 )                                                /*!< EADC_T::DDAT1: OV Position             */
#define EADC_DDAT1_OV_Msk            ( 0x1ul << EADC_DDAT1_OV_Pos )                        /*!< EADC_T::DDAT1: OV Mask                 */

#define EADC_DDAT1_VALID_Pos         ( 17 )                                                /*!< EADC_T::DDAT1: VALID Position          */
#define EADC_DDAT1_VALID_Msk         ( 0x1ul << EADC_DDAT1_VALID_Pos )                     /*!< EADC_T::DDAT1: VALID Mask              */

#define EADC_DDAT2_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DDAT2: RESULT Position         */
#define EADC_DDAT2_RESULT_Msk        ( 0xfffful << EADC_DDAT2_RESULT_Pos )                 /*!< EADC_T::DDAT2: RESULT Mask             */

#define EADC_DDAT2_OV_Pos            ( 16 )                                                /*!< EADC_T::DDAT2: OV Position             */
#define EADC_DDAT2_OV_Msk            ( 0x1ul << EADC_DDAT2_OV_Pos )                        /*!< EADC_T::DDAT2: OV Mask                 */

