FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/eadc_reg.h
#define EADC_DDAT2_VALID_Pos         ( 17 )                                                /*!< EADC_T::DDAT2: VALID Position          */
#define EADC_DDAT2_VALID_Msk         ( 0x1ul << EADC_DDAT2_VALID_Pos )                     /*!< EADC_T::DDAT2: VALID Mask              */

#define EADC_DDAT3_RESULT_Pos        ( 0 )                                                 /*!< EADC_T::DDAT3: RESULT Position         */
#define EADC_DDAT3_RESULT_Msk        ( 0xfffful << EADC_DDAT3_RESULT_Pos )                 /*!< EADC_T::DDAT3: RESULT Mask             */

#define EADC_DDAT3_OV_Pos            ( 16 )                                                /*!< EADC_T::DDAT3: OV Position             */
#define EADC_DDAT3_OV_Msk            ( 0x1ul << EADC_DDAT3_OV_Pos )                        /*!< EADC_T::DDAT3: OV Mask                 */

#define EADC_DDAT3_VALID_Pos         ( 17 )                                                /*!< EADC_T::DDAT3: VALID Position          */
#define EADC_DDAT3_VALID_Msk         ( 0x1ul << EADC_DDAT3_VALID_Pos )                     /*!< EADC_T::DDAT3: VALID Mask              */

#define EADC_PWRM_PWUPRDY_Pos        ( 0 )                                                 /*!< EADC_T::PWRM: PWUPRDY Position         */
#define EADC_PWRM_PWUPRDY_Msk        ( 0x1ul << EADC_PWRM_PWUPRDY_Pos )                    /*!< EADC_T::PWRM: PWUPRDY Mask             */

#define EADC_PWRM_PWUCALEN_Pos       ( 1 )                                                 /*!< EADC_T::PWRM: PWUCALEN Position        */
#define EADC_PWRM_PWUCALEN_Msk       ( 0x1ul << EADC_PWRM_PWUCALEN_Pos )                   /*!< EADC_T::PWRM: PWUCALEN Mask            */

#define EADC_PWRM_PWDMOD_Pos         ( 2 )                                                 /*!< EADC_T::PWRM: PWDMOD Position          */
#define EADC_PWRM_PWDMOD_Msk         ( 0x3ul << EADC_PWRM_PWDMOD_Pos )                     /*!< EADC_T::PWRM: PWDMOD Mask              */

#define EADC_PWRM_LDOSUT_Pos         ( 8 )                                                 /*!< EADC_T::PWRM: LDOSUT Position          */
#define EADC_PWRM_LDOSUT_Msk         ( 0xffful << EADC_PWRM_LDOSUT_Pos )                   /*!< EADC_T::PWRM: LDOSUT Mask              */

#define EADC_CALCTL_CALSTART_Pos     ( 1 )                                                 /*!< EADC_T::CALCTL: CALSTART Position      */
#define EADC_CALCTL_CALSTART_Msk     ( 0x1ul << EADC_CALCTL_CALSTART_Pos )                 /*!< EADC_T::CALCTL: CALSTART Mask          */

#define EADC_CALCTL_CALDONE_Pos      ( 2 )                                                 /*!< EADC_T::CALCTL: CALDONE Position       */
#define EADC_CALCTL_CALDONE_Msk      ( 0x1ul << EADC_CALCTL_CALDONE_Pos )                  /*!< EADC_T::CALCTL: CALDONE Mask           */

#define EADC_CALCTL_CALSEL_Pos       ( 3 )                                                 /*!< EADC_T::CALCTL: CALSEL Position        */
#define EADC_CALCTL_CALSEL_Msk       ( 0x1ul << EADC_CALCTL_CALSEL_Pos )                   /*!< EADC_T::CALCTL: CALSEL Mask            */

#define EADC_CALDWRD_CALWORD_Pos     ( 0 )                                                 /*!< EADC_T::CALDWRD: CALWORD Position      */
#define EADC_CALDWRD_CALWORD_Msk     ( 0x7ful << EADC_CALDWRD_CALWORD_Pos )                /*!< EADC_T::CALDWRD: CALWORD Mask          */

/**@}*/ /* EADC_CONST */
/**@}*/ /* end of EADC register group */
/**@}*/ /* end of REGISTER group */



#endif /* __EADC_REG_H__ */
